-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /nas-vol/projects/data_vol4/wkerr_ethnicity_project/networks/macro
> /replication/nw-macro-2b.log
  log type:  text
 opened on:   1 Sep 2015, 11:38:05

.  * William Kerr, To God's Glory;
. * Extension to Consider Resource Constraint;
. * stata-mp8-10g -b do nw-macro-2b.do;
. * Last Modified: May 2015;
. clear all;

.  set matsize 5000;

.  set more off;

. local znber nber_emp nber_vadd nber_rvadd nber_sales nber_rsales nber_lprod n
> ber_rlprod;

. local znber2 nber_emp* nber_vadd* nber_rvadd* nber_sales* nber_rsales* nber_l
> prod* nber_rlprod*;

. local znber3 *nber_emp *nber_vadd *nber_rvadd *nber_sales *nber_rsales *nber_
> lprod *nber_rlprod;

. local znberT nber_rvadd nber_emp;

. local trade l_import_usch l_import_otch;

. local SHOCK zlnber_rvadd zlnber_sales zlnber_rsales zlnber_emp lnber_rvadd ln
> ber_emp lnber_rlprod l_import_usch l_import_otch esfed ltfp4 ltfp5 lfmct lfuc
> t;

. local GEO GAD;

. local LB 0.1;

. local UB 99.9;

. local SH l_import_otch;

. **************************;
. **************************;
. *** Prepare Resource    **;
. **************************;
. **************************;
. *** Prepare federal spending shock entry;
. use ./raw/all_sales, clear;

.  sort sic87dd;

.  merge sic87dd using ./temp/list-sic87dd;
(note: you are using old merge syntax; see [D] merge for new syntax)

.  tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        141       26.45       26.45
          3 |        392       73.55      100.00
------------+-----------------------------------
      Total |        533      100.00

.  gen mfg=(_m==3);

. gen gov=def_sales+nondef_sales;

.  gen mgov=gov if mfg==1;
(141 missing values generated)

.  gen temp1=1;

. collapse (sum) gov mgov, by(temp1) fast;

. gen ratio=mgov/gov;

.  sum ratio;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       ratio |         1    .2436557           .   .2436557   .2436557

. use ./temp/list-year, clear;

.  duplicates drop;

Duplicates in terms of all variables

(0 observations are duplicates)

. replace year=year-1;
(21 real changes made)

. for any def fed: gen spX=.;

->  gen spdef=.
(21 missing values generated)

->  gen spfed=.
(21 missing values generated)

. replace spdef=281889 if year==1988;
(0 real changes made)

.         replace spfed=1064416 if year==1988;
(0 real changes made)

. replace spdef=294829 if year==1989;
(0 real changes made)

.         replace spfed=1143744 if year==1989;
(0 real changes made)

. replace spdef=289694 if year==1990;
(1 real change made)

.         replace spfed=1252993 if year==1990;
(1 real change made)

. replace spdef=261860 if year==1991;
(1 real change made)

.         replace spfed=1324226 if year==1991;
(1 real change made)

. replace spdef=286574 if year==1992;
(1 real change made)

.         replace spfed=1381529 if year==1992;
(1 real change made)

. replace spdef=278510 if year==1993;
(1 real change made)

.         replace spfed=1409386 if year==1993;
(1 real change made)

. replace spdef=268577 if year==1994;
(1 real change made)

.         replace spfed=1461753 if year==1994;
(1 real change made)

. replace spdef=259487 if year==1995;
(1 real change made)

.         replace spfed=1515742 if year==1995;
(1 real change made)

. replace spdef=253196 if year==1996;
(1 real change made)

.         replace spfed=1560484 if year==1996;
(1 real change made)

. replace spdef=258262 if year==1997;
(1 real change made)

.         replace spfed=1601116 if year==1997;
(1 real change made)

. replace spdef=255793 if year==1998;
(1 real change made)

.         replace spfed=1652458 if year==1998;
(1 real change made)

. replace spdef=261196 if year==1999;
(1 real change made)

.         replace spfed=1701842 if year==1999;
(1 real change made)

. replace spdef=281028 if year==2000;
(1 real change made)

.         replace spfed=1788950 if year==2000;
(1 real change made)

. replace spdef=290185 if year==2001;
(1 real change made)

.         replace spfed=1862846 if year==2001;
(1 real change made)

. replace spdef=331845 if year==2002;
(1 real change made)

.         replace spfed=2010894 if year==2002;
(1 real change made)

. replace spdef=388686 if year==2003;
(1 real change made)

.         replace spfed=2159899 if year==2003;
(1 real change made)

. replace spdef=437034 if year==2004;
(1 real change made)

.         replace spfed=2292841 if year==2004;
(1 real change made)

. replace spdef=474354 if year==2005;
(1 real change made)

.         replace spfed=2471957 if year==2005;
(1 real change made)

. replace spdef=499344 if year==2006;
(1 real change made)

.         replace spfed=2655050 if year==2006;
(1 real change made)

. replace spdef=528578 if year==2007;
(1 real change made)

.         replace spfed=2728686 if year==2007;
(1 real change made)

. replace spdef=594662 if year==2008;
(1 real change made)

.         replace spfed=2982544 if year==2008;
(1 real change made)

. replace spdef=636775 if year==2009;
(1 real change made)

.         replace spfed=3517677 if year==2009;
(1 real change made)

. replace spdef=666715 if year==2010;
(1 real change made)

.         replace spfed=3457079 if year==2010;
(1 real change made)

. replace spdef=678074 if year==2011;
(0 real changes made)

.         replace spfed=3603059 if year==2011;
(0 real changes made)

. replace spdef=650867 if year==2012;
(0 real changes made)

.         replace spfed=3537127 if year==2012;
(0 real changes made)

. replace spdef=607800 if year==2013;
(0 real changes made)

.         replace spfed=3454605 if year==2013;
(0 real changes made)

. replace year=year+1;
(21 real changes made)

. sort year;

.  for var sp*: replace X=X*1000000*.243655 \ gen DX=X-X[_n-1];

->  replace spdef=spdef*1000000*.243655
(21 real changes made)

->  gen Dspdef=spdef-spdef[_n-1]
(1 missing value generated)

->  replace spfed=spfed*1000000*.243655
(21 real changes made)

->  gen Dspfed=spfed-spfed[_n-1]
(1 missing value generated)

. compress;
  (0 bytes saved)

. save ./temp/federal-annual, replace;
file ./temp/federal-annual.dta saved

. *** Generate complete import sequence;
. use if exporter=="CHN" using ./raw/sic87dd_trade_data, clear;
(SIC trade data for ADH post collapse of problem SIC industries)

. sort year;

.  merge year using ./raw/pce, nok;
(note: you are using old merge syntax; see [D] merge for new syntax)
variable year does not uniquely identify observations in the master data

.  tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     13,128      100.00      100.00
------------+-----------------------------------
      Total |     13,128      100.00

.  drop _m;

.  gen impus=imports*pce if importer=="USA";
(6627 missing values generated)

. gen impot=imports*pce if importer=="OTH";
(6501 missing values generated)

. collapse (sum) impus impot, by(year) fast;

. sort year;

. for var imp*: gen DX=X-X[_n-1];

->  gen Dimpus=impus-impus[_n-1]
(1 missing value generated)

->  gen Dimpot=impot-impot[_n-1]
(1 missing value generated)

. save ./temp/trade-annual, replace;
file ./temp/trade-annual.dta saved

. *** Combine together;
. use sic87dd year nber_vadd lnber_sales using ./temp/shock-baselines, clear;

.  gen nber_sales=exp(lnber_sales);
(888 missing values generated)

.  drop lnber_sales;

.  drop if nber_sales==.;
(888 observations deleted)

. collapse (sum) nber_sales, by(year) fast;

. sort year;

.  merge year using ./temp/federal-annual, nok;
(note: you are using old merge syntax; see [D] merge for new syntax)

.  tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         19      100.00      100.00
------------+-----------------------------------
      Total |         19      100.00

.  drop _m;

. sort year;

.  merge year using ./temp/trade-annual, nok;
(note: you are using old merge syntax; see [D] merge for new syntax)

.  tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2       10.53       10.53
          3 |         17       89.47      100.00
------------+-----------------------------------
      Total |         19      100.00

.  drop _m;

. keep year Dimpus Dimpot Dspfed;

.  for var D*: ren X AX;

->  ren Dspfed ADspfed

->  ren Dimpus ADimpus

->  ren Dimpot ADimpot

. sort year;

.  save ./temp/resourcemerger, replace;
file ./temp/resourcemerger.dta saved

. **************************;
. **************************;
. *** Prepare Shocks      **;
. **************************;
. **************************;
. forvalues i=1(1)1 {;
  2. *** Open data and recode year;
. use ./temp/shock-baselines, clear;
  3.  recode year 1991=1 1993=2 1995=3 1997=4 1999=5 2001=6 2003=7 2005=8 2007=
> 9 2009=10 if `i'==2;
  4.  recode year 1991=1 1994=2 1997=3 2000=4 2003=5 2006=6 2009=7 if `i'==3;
  5.  recode year 1991=1 1995=2 1999=3 2003=4 2007=5 if `i'==4;
  6.  recode year 1991=1 1996=2 2001=3 2006=4 if `i'==5;
  7. gen dropped=(year>10);
  8.  replace dropped=0 if `i'==1;
  9.  keep if dropped==0;
 10.  drop dropped;
 11. *** Prepare differences for network analysis;
. tsset sic87dd year;
 12. for var lnber_rvadd lnber_sales lnber_rsales lnber_emp: gen zX=X;
 13. for var zlnber_rvadd zlnber_sales zlnber_rsales zlnber_emp l_import_usch l
> _import_otch esfed ltfp4 ltfp5 lfmct lfuct: 
> \ gen DX=X-l1.X \ egen temp1=sd(DX) \ replace DX=DX/temp1 \ drop temp1;
 14. for var lnber*: gen DX=X-l1.X;
 15. for var D*: 
> \ egen temp1=pctile(X), p(`LB') \ egen temp2=pctile(X), p(`UB')
> \ replace X=temp1 if X<temp1 \ replace X=temp2 if X>temp2 & X!=. \ drop temp*
> ;
 16. sort sic87dd year;
 17.  save ./temp/shock-baselines-temp, replace;
 18. *** Merge grids, trade data, productivity data, and spending data - upstre
> am;
. use sic87dd_up sic87dd_down year using ./temp/sic87-year-grid-full, clear;
 19.  recode year 1991=1 1993=2 1995=3 1997=4 1999=5 2001=6 2003=7 2005=8 2007=
> 9 2009=10 if `i'==2;
 20.  recode year 1991=1 1994=2 1997=3 2000=4 2003=5 2006=6 2009=7 if `i'==3;
 21.  recode year 1991=1 1995=2 1999=3 2003=4 2007=5 if `i'==4;
 22.  recode year 1991=1 1996=2 2001=3 2006=4 if `i'==5;
 23. gen dropped=(year>10);
 24.  replace dropped=0 if `i'==1;
 25.  keep if dropped==0;
 26.  drop dropped;
 27.  tab year;
 28. ren sic87dd_up sic87dd;
 29.  sort sic87dd year;
 30.  merge sic87dd year using ./temp/shock-baselines-temp, keep(D*) nok;
 31.  assert _m==3;
 32.  drop _m;
 33.  renpfix D UD;
 34.  ren sic87dd sic87dd_up;
 35.  ren sic87dd_down sic87dd;
 36.  sort sic87dd year;
 37.  merge sic87dd year using ./temp/shock-baselines-temp, keep(D*) nok;
 38.  assert _m==3;
 39.  drop _m;
 40.  renpfix D DD;
 41.  ren sic87dd sic87dd_down;
 42. *** Merge networks;
. sort sic87dd_up sic87dd_down;
 43.  merge sic87dd_up sic87dd_down using ./temp/combined-networks, nok;
 44.  tab _m;
 45.  keep if _m==3;
 46.  drop _m;
 47. for var geo12 geo123: replace X=. if sic87dd_up==sic87dd_down;
 48. sort sic87dd_up sic87dd_down;
 49.  save ./temp/sic87-year-grid-temp2b, replace;
 50. *** Prepare contemporaneous upstream stimulus;
. for any `SHOCK': 
> \ gen ZTFUX=UDX*io_perc_down
> \ gen ZTLUX=UDX*io_Lperc_down
> \ gen ZDLUX=UDX*(1+io_Lperc_down) if sic87dd_up==sic87dd_down
> \ gen ZNLUX=UDX*io_Lperc_down if sic87dd_up!=sic87dd_down
> \ gen GAUX=UDX*geo12
> \ gen GHUX=UDX*geo123;
 51. collapse (sum) Z* G*, by(sic87dd_down year) fast;
 52.  ren sic87dd sic87dd;
 53. sort sic87dd year;
 54.  save ./temp/sh-tr-upstream, replace;
 55. *** Prepare contemporaneous downstream stimulus;
. use ./temp/sic87-year-grid-temp2b, clear;
 56. sort year;
 57.  merge year using ./temp/resourcemerger;
 58.  tab _m;
 59.  drop _m;
 60. egen temp1=sum(Dnber_vadd);
 61.  egen temp2=sum(Dnber_vadd), by(sic87dd_down);
 62.  gen MULT=temp2/temp1;
 63.  su MULT;
 64.  drop temp*;
 65. gen RLI=io_Lperc_up;
 66.  replace RLI=RLI+1 if sic87dd_up==sic87dd_down;
 67. for any `SHOCK': 
> \ gen ZTFDX=DDX*io_perc_up
> \ gen ZTLDX=DDX*io_Lperc_up
> \ gen ZDLDX=DDX*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
> \ gen ZNLDX=DDX*io_Lperc_up if sic87dd_up!=sic87dd_down
> \ gen GADX=DDX*geo12
> \ gen GHDX=DDX*geo123;
 68. gen ZR4LDl_import_usch=ADimpus/Dnber_vadd*RLI*MULT;
 69. gen ZR4LDl_import_otch=ADimpot/Dnber_vadd*RLI*MULT;
 70. gen ZR4LDesfed=ADspfed/Dnber_vadd*RLI*MULT;
 71. collapse (sum) Z* G*, by(sic87dd_up year) fast;
 72.  ren sic87dd sic87dd;
 73. sort sic87dd year;
 74.  merge sic87dd year using ./temp/sh-tr-upstream;
 75.  assert _m==3;
 76.  drop _m;
 77. sort sic87dd year;
 78.  save ./temp/shock-stimulus-temp, replace;
 79. erase ./temp/sh-tr-upstream.dta;
 80.  erase ./temp/sic87-year-grid-temp2b.dta;
 81. *** Unite pieces together;
. use ./temp/shock-baselines-temp, clear;
 82. for any `SHOCK': ren DX DOX;
 83.  renpfix DOlnb Dlnb;
 84. sort sic87dd year;
 85.  merge sic87dd year using ./temp/shock-stimulus-temp;
 86.  assert _m==3;
 87.  drop _m;
 88. tsset sic87dd year;
 89.  for var D*: gen X_l0=X \ gen X_l1=l1.X \ gen X_l2=l2.X \ gen X_l3=l3.X;
 90.  for var Z* G*: gen DX_l0=X \ gen DX_l1=l1.X \ gen DX_l2=l2.X \ gen DX_l3=
> l3.X;
 91.  gen sic3=int(sic87dd/10);
 92.  gen sic2=int(sic3/10);
 93.  gen clstr=sic87dd;
 94. *** Prepare weights and traded category (only used for annual program);
. gen wt1=1;
 95. egen temp0=min(year);
 96. gen temp1=ln(nber_vadd) if year==temp0;
 97.  egen wt2=mean(temp1), by(sic87dd);
 98.  drop temp1;
 99. gen temp1=nber_emp if year==temp0;
100.  egen wt3=mean(temp1), by(sic87dd);
101.  drop temp1;
102.  sort sic87dd;
103.  merge sic87dd using ./temp/sic87-hhi, keep(hhi) nok;
104.  tab _m;
105.  drop _m;
106. egen temp1=median(hhi);
107.  gen traded=(hhi>temp1);
108.  drop temp1 hhi;
109. *** Save prep file;
. sort sic87dd year;
110.  xi i.year;
111.  compress;
112.  save ./temp/nw-macro2b`i', replace;
113. for any baselines stimulus: erase ./temp/shock-X-temp.dta;
114. };
(year: 0 changes made)
(year: 0 changes made)
(year: 0 changes made)
(year: 0 changes made)
(8232 real changes made)
(0 observations deleted)
       panel variable:  sic87dd (strongly balanced)
        time variable:  year, 1991 to 2011
                delta:  1 unit

->  gen zlnber_rvadd=lnber_rvadd
(888 missing values generated)

->  gen zlnber_sales=lnber_sales
(888 missing values generated)

->  gen zlnber_rsales=lnber_rsales
(888 missing values generated)

->  gen zlnber_emp=lnber_emp
(888 missing values generated)

-> 

->  gen Dzlnber_rvadd=zlnber_rvadd-l1.zlnber_rvadd
(1280 missing values generated)

->  egen temp1=sd(Dzlnber_rvadd)

->  replace Dzlnber_rvadd=Dzlnber_rvadd/temp1
(6951 real changes made)

->  drop temp1

-> 

->  gen Dzlnber_sales=zlnber_sales-l1.zlnber_sales
(1280 missing values generated)

->  egen temp1=sd(Dzlnber_sales)

->  replace Dzlnber_sales=Dzlnber_sales/temp1
(6952 real changes made)

->  drop temp1

-> 

->  gen Dzlnber_rsales=zlnber_rsales-l1.zlnber_rsales
(1280 missing values generated)

->  egen temp1=sd(Dzlnber_rsales)

->  replace Dzlnber_rsales=Dzlnber_rsales/temp1
(6952 real changes made)

->  drop temp1

-> 

->  gen Dzlnber_emp=zlnber_emp-l1.zlnber_emp
(1280 missing values generated)

->  egen temp1=sd(Dzlnber_emp)

->  replace Dzlnber_emp=Dzlnber_emp/temp1
(6701 real changes made)

->  drop temp1

-> 

->  gen Dl_import_usch=l_import_usch-l1.l_import_usch
(392 missing values generated)

->  egen temp1=sd(Dl_import_usch)

->  replace Dl_import_usch=Dl_import_usch/temp1
(7641 real changes made)

->  drop temp1

-> 

->  gen Dl_import_otch=l_import_otch-l1.l_import_otch
(392 missing values generated)

->  egen temp1=sd(Dl_import_otch)

->  replace Dl_import_otch=Dl_import_otch/temp1
(7741 real changes made)

->  drop temp1

-> 

->  gen Desfed=esfed-l1.esfed
(392 missing values generated)

->  egen temp1=sd(Desfed)

->  replace Desfed=Desfed/temp1
(7720 real changes made)

->  drop temp1

-> 

->  gen Dltfp4=ltfp4-l1.ltfp4
(1267 missing values generated)

->  egen temp1=sd(Dltfp4)

->  replace Dltfp4=Dltfp4/temp1
(6912 real changes made)

->  drop temp1

-> 

->  gen Dltfp5=ltfp5-l1.ltfp5
(1267 missing values generated)

->  egen temp1=sd(Dltfp5)

->  replace Dltfp5=Dltfp5/temp1
(6908 real changes made)

->  drop temp1

-> 

->  gen Dlfmct=lfmct-l1.lfmct
(1585 missing values generated)

->  egen temp1=sd(Dlfmct)

->  replace Dlfmct=Dlfmct/temp1
(6647 real changes made)

->  drop temp1

-> 

->  gen Dlfuct=lfuct-l1.lfuct
(1585 missing values generated)

->  egen temp1=sd(Dlfuct)

->  replace Dlfuct=Dlfuct/temp1
(6647 real changes made)

->  drop temp1

->  gen Dlnber_emp=lnber_emp-l1.lnber_emp
(1280 missing values generated)

->  gen Dlnber_vadd=lnber_vadd-l1.lnber_vadd
(1280 missing values generated)

->  gen Dlnber_sales=lnber_sales-l1.lnber_sales
(1280 missing values generated)

->  gen Dlnber_rvadd=lnber_rvadd-l1.lnber_rvadd
(1280 missing values generated)

->  gen Dlnber_rsales=lnber_rsales-l1.lnber_rsales
(1280 missing values generated)

->  gen Dlnber_lprod=lnber_lprod-l1.lnber_lprod
(1280 missing values generated)

->  gen Dlnber_rlprod=lnber_rlprod-l1.lnber_rlprod
(1280 missing values generated)

-> 

->  egen temp1=pctile(Dzlnber_rvadd), p(0.1)

->  egen temp2=pctile(Dzlnber_rvadd), p(99.9)

->  replace Dzlnber_rvadd=temp1 if Dzlnber_rvadd<temp1
(6 real changes made)

->  replace Dzlnber_rvadd=temp2 if Dzlnber_rvadd>temp2 & Dzlnber_rvadd!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dzlnber_sales), p(0.1)

->  egen temp2=pctile(Dzlnber_sales), p(99.9)

->  replace Dzlnber_sales=temp1 if Dzlnber_sales<temp1
(6 real changes made)

->  replace Dzlnber_sales=temp2 if Dzlnber_sales>temp2 & Dzlnber_sales!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dzlnber_rsales), p(0.1)

->  egen temp2=pctile(Dzlnber_rsales), p(99.9)

->  replace Dzlnber_rsales=temp1 if Dzlnber_rsales<temp1
(6 real changes made)

->  replace Dzlnber_rsales=temp2 if Dzlnber_rsales>temp2 & Dzlnber_rsales!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dzlnber_emp), p(0.1)

->  egen temp2=pctile(Dzlnber_emp), p(99.9)

->  replace Dzlnber_emp=temp1 if Dzlnber_emp<temp1
(6 real changes made)

->  replace Dzlnber_emp=temp2 if Dzlnber_emp>temp2 & Dzlnber_emp!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dl_import_usch), p(0.1)

->  egen temp2=pctile(Dl_import_usch), p(99.9)

->  replace Dl_import_usch=temp1 if Dl_import_usch<temp1
(7 real changes made)

->  replace Dl_import_usch=temp2 if Dl_import_usch>temp2 & Dl_import_usch!=.
(7 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dl_import_otch), p(0.1)

->  egen temp2=pctile(Dl_import_otch), p(99.9)

->  replace Dl_import_otch=temp1 if Dl_import_otch<temp1
(7 real changes made)

->  replace Dl_import_otch=temp2 if Dl_import_otch>temp2 & Dl_import_otch!=.
(7 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Desfed), p(0.1)

->  egen temp2=pctile(Desfed), p(99.9)

->  replace Desfed=temp1 if Desfed<temp1
(7 real changes made)

->  replace Desfed=temp2 if Desfed>temp2 & Desfed!=.
(7 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dltfp4), p(0.1)

->  egen temp2=pctile(Dltfp4), p(99.9)

->  replace Dltfp4=temp1 if Dltfp4<temp1
(6 real changes made)

->  replace Dltfp4=temp2 if Dltfp4>temp2 & Dltfp4!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dltfp5), p(0.1)

->  egen temp2=pctile(Dltfp5), p(99.9)

->  replace Dltfp5=temp1 if Dltfp5<temp1
(6 real changes made)

->  replace Dltfp5=temp2 if Dltfp5>temp2 & Dltfp5!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlfmct), p(0.1)

->  egen temp2=pctile(Dlfmct), p(99.9)

->  replace Dlfmct=temp1 if Dlfmct<temp1
(6 real changes made)

->  replace Dlfmct=temp2 if Dlfmct>temp2 & Dlfmct!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlfuct), p(0.1)

->  egen temp2=pctile(Dlfuct), p(99.9)

->  replace Dlfuct=temp1 if Dlfuct<temp1
(6 real changes made)

->  replace Dlfuct=temp2 if Dlfuct>temp2 & Dlfuct!=.
(5 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlnber_emp), p(0.1)

->  egen temp2=pctile(Dlnber_emp), p(99.9)

->  replace Dlnber_emp=temp1 if Dlnber_emp<temp1
(6 real changes made)

->  replace Dlnber_emp=temp2 if Dlnber_emp>temp2 & Dlnber_emp!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlnber_vadd), p(0.1)

->  egen temp2=pctile(Dlnber_vadd), p(99.9)

->  replace Dlnber_vadd=temp1 if Dlnber_vadd<temp1
(6 real changes made)

->  replace Dlnber_vadd=temp2 if Dlnber_vadd>temp2 & Dlnber_vadd!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlnber_sales), p(0.1)

->  egen temp2=pctile(Dlnber_sales), p(99.9)

->  replace Dlnber_sales=temp1 if Dlnber_sales<temp1
(6 real changes made)

->  replace Dlnber_sales=temp2 if Dlnber_sales>temp2 & Dlnber_sales!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlnber_rvadd), p(0.1)

->  egen temp2=pctile(Dlnber_rvadd), p(99.9)

->  replace Dlnber_rvadd=temp1 if Dlnber_rvadd<temp1
(6 real changes made)

->  replace Dlnber_rvadd=temp2 if Dlnber_rvadd>temp2 & Dlnber_rvadd!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlnber_rsales), p(0.1)

->  egen temp2=pctile(Dlnber_rsales), p(99.9)

->  replace Dlnber_rsales=temp1 if Dlnber_rsales<temp1
(6 real changes made)

->  replace Dlnber_rsales=temp2 if Dlnber_rsales>temp2 & Dlnber_rsales!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlnber_lprod), p(0.1)

->  egen temp2=pctile(Dlnber_lprod), p(99.9)

->  replace Dlnber_lprod=temp1 if Dlnber_lprod<temp1
(6 real changes made)

->  replace Dlnber_lprod=temp2 if Dlnber_lprod>temp2 & Dlnber_lprod!=.
(6 real changes made)

->  drop temp*

-> 

->  egen temp1=pctile(Dlnber_rlprod), p(0.1)

->  egen temp2=pctile(Dlnber_rlprod), p(99.9)

->  replace Dlnber_rlprod=temp1 if Dlnber_rlprod<temp1
(6 real changes made)

->  replace Dlnber_rlprod=temp2 if Dlnber_rlprod>temp2 & Dlnber_rlprod!=.
(6 real changes made)

->  drop temp*
(note: file ./temp/shock-baselines-temp.dta not found)
file ./temp/shock-baselines-temp.dta saved
(year: 0 changes made)
(year: 0 changes made)
(year: 0 changes made)
(year: 0 changes made)
(3226944 real changes made)
(0 observations deleted)

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1991 |    153,664        4.76        4.76
       1992 |    153,664        4.76        9.52
       1993 |    153,664        4.76       14.29
       1994 |    153,664        4.76       19.05
       1995 |    153,664        4.76       23.81
       1996 |    153,664        4.76       28.57
       1997 |    153,664        4.76       33.33
       1998 |    153,664        4.76       38.10
       1999 |    153,664        4.76       42.86
       2000 |    153,664        4.76       47.62
       2001 |    153,664        4.76       52.38
       2002 |    153,664        4.76       57.14
       2003 |    153,664        4.76       61.90
       2004 |    153,664        4.76       66.67
       2005 |    153,664        4.76       71.43
       2006 |    153,664        4.76       76.19
       2007 |    153,664        4.76       80.95
       2008 |    153,664        4.76       85.71
       2009 |    153,664        4.76       90.48
       2010 |    153,664        4.76       95.24
       2011 |    153,664        4.76      100.00
------------+-----------------------------------
      Total |  3,226,944      100.00
(note: you are using old merge syntax; see [D] merge for new syntax)
variables sic87dd year do not uniquely identify observations in the master
    data
(note: you are using old merge syntax; see [D] merge for new syntax)
variables sic87dd year do not uniquely identify observations in the master
    data
(note: you are using old merge syntax; see [D] merge for new syntax)
variables sic87dd_up sic87dd_down do not uniquely identify observations in
    the master data

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |  3,226,944      100.00      100.00
------------+-----------------------------------
      Total |  3,226,944      100.00
(0 observations deleted)

->  replace geo12=. if sic87dd_up==sic87dd_down
(8232 real changes made, 8232 to missing)

->  replace geo123=. if sic87dd_up==sic87dd_down
(0 real changes made)
(note: file ./temp/sic87-year-grid-temp2b.dta not found)
file ./temp/sic87-year-grid-temp2b.dta saved

-> 

->  gen ZTFUzlnber_rvadd=UDzlnber_rvadd*io_perc_down
(501760 missing values generated)

->  gen ZTLUzlnber_rvadd=UDzlnber_rvadd*io_Lperc_down
(501760 missing values generated)

->  gen ZDLUzlnber_rvadd=UDzlnber_rvadd*(1+io_Lperc_down) if sic87dd_up==sic87d
> d_down
(3219992 missing values generated)

->  gen ZNLUzlnber_rvadd=UDzlnber_rvadd*io_Lperc_down if sic87dd_up!=sic87dd_do
> wn
(508712 missing values generated)

->  gen GAUzlnber_rvadd=UDzlnber_rvadd*geo12
(508712 missing values generated)

->  gen GHUzlnber_rvadd=UDzlnber_rvadd*geo123
(508712 missing values generated)

-> 

->  gen ZTFUzlnber_sales=UDzlnber_sales*io_perc_down
(501760 missing values generated)

->  gen ZTLUzlnber_sales=UDzlnber_sales*io_Lperc_down
(501760 missing values generated)

->  gen ZDLUzlnber_sales=UDzlnber_sales*(1+io_Lperc_down) if sic87dd_up==sic87d
> d_down
(3219992 missing values generated)

->  gen ZNLUzlnber_sales=UDzlnber_sales*io_Lperc_down if sic87dd_up!=sic87dd_do
> wn
(508712 missing values generated)

->  gen GAUzlnber_sales=UDzlnber_sales*geo12
(508712 missing values generated)

->  gen GHUzlnber_sales=UDzlnber_sales*geo123
(508712 missing values generated)

-> 

->  gen ZTFUzlnber_rsales=UDzlnber_rsales*io_perc_down
(501760 missing values generated)

->  gen ZTLUzlnber_rsales=UDzlnber_rsales*io_Lperc_down
(501760 missing values generated)

->  gen ZDLUzlnber_rsales=UDzlnber_rsales*(1+io_Lperc_down) if sic87dd_up==sic8
> 7dd_down
(3219992 missing values generated)

->  gen ZNLUzlnber_rsales=UDzlnber_rsales*io_Lperc_down if sic87dd_up!=sic87dd_
> down
(508712 missing values generated)

->  gen GAUzlnber_rsales=UDzlnber_rsales*geo12
(508712 missing values generated)

->  gen GHUzlnber_rsales=UDzlnber_rsales*geo123
(508712 missing values generated)

-> 

->  gen ZTFUzlnber_emp=UDzlnber_emp*io_perc_down
(501760 missing values generated)

->  gen ZTLUzlnber_emp=UDzlnber_emp*io_Lperc_down
(501760 missing values generated)

->  gen ZDLUzlnber_emp=UDzlnber_emp*(1+io_Lperc_down) if sic87dd_up==sic87dd_do
> wn
(3219992 missing values generated)

->  gen ZNLUzlnber_emp=UDzlnber_emp*io_Lperc_down if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GAUzlnber_emp=UDzlnber_emp*geo12
(508712 missing values generated)

->  gen GHUzlnber_emp=UDzlnber_emp*geo123
(508712 missing values generated)

-> 

->  gen ZTFUlnber_rvadd=UDlnber_rvadd*io_perc_down
(501760 missing values generated)

->  gen ZTLUlnber_rvadd=UDlnber_rvadd*io_Lperc_down
(501760 missing values generated)

->  gen ZDLUlnber_rvadd=UDlnber_rvadd*(1+io_Lperc_down) if sic87dd_up==sic87dd_
> down
(3219992 missing values generated)

->  gen ZNLUlnber_rvadd=UDlnber_rvadd*io_Lperc_down if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GAUlnber_rvadd=UDlnber_rvadd*geo12
(508712 missing values generated)

->  gen GHUlnber_rvadd=UDlnber_rvadd*geo123
(508712 missing values generated)

-> 

->  gen ZTFUlnber_emp=UDlnber_emp*io_perc_down
(501760 missing values generated)

->  gen ZTLUlnber_emp=UDlnber_emp*io_Lperc_down
(501760 missing values generated)

->  gen ZDLUlnber_emp=UDlnber_emp*(1+io_Lperc_down) if sic87dd_up==sic87dd_down
(3219992 missing values generated)

->  gen ZNLUlnber_emp=UDlnber_emp*io_Lperc_down if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GAUlnber_emp=UDlnber_emp*geo12
(508712 missing values generated)

->  gen GHUlnber_emp=UDlnber_emp*geo123
(508712 missing values generated)

-> 

->  gen ZTFUlnber_rlprod=UDlnber_rlprod*io_perc_down
(501760 missing values generated)

->  gen ZTLUlnber_rlprod=UDlnber_rlprod*io_Lperc_down
(501760 missing values generated)

->  gen ZDLUlnber_rlprod=UDlnber_rlprod*(1+io_Lperc_down) if sic87dd_up==sic87d
> d_down
(3219992 missing values generated)

->  gen ZNLUlnber_rlprod=UDlnber_rlprod*io_Lperc_down if sic87dd_up!=sic87dd_do
> wn
(508712 missing values generated)

->  gen GAUlnber_rlprod=UDlnber_rlprod*geo12
(508712 missing values generated)

->  gen GHUlnber_rlprod=UDlnber_rlprod*geo123
(508712 missing values generated)

-> 

->  gen ZTFUl_import_usch=UDl_import_usch*io_perc_down
(153664 missing values generated)

->  gen ZTLUl_import_usch=UDl_import_usch*io_Lperc_down
(153664 missing values generated)

->  gen ZDLUl_import_usch=UDl_import_usch*(1+io_Lperc_down) if sic87dd_up==sic8
> 7dd_down
(3219104 missing values generated)

->  gen ZNLUl_import_usch=UDl_import_usch*io_Lperc_down if sic87dd_up!=sic87dd_
> down
(161504 missing values generated)

->  gen GAUl_import_usch=UDl_import_usch*geo12
(161504 missing values generated)

->  gen GHUl_import_usch=UDl_import_usch*geo123
(161504 missing values generated)

-> 

->  gen ZTFUl_import_otch=UDl_import_otch*io_perc_down
(153664 missing values generated)

->  gen ZTLUl_import_otch=UDl_import_otch*io_Lperc_down
(153664 missing values generated)

->  gen ZDLUl_import_otch=UDl_import_otch*(1+io_Lperc_down) if sic87dd_up==sic8
> 7dd_down
(3219104 missing values generated)

->  gen ZNLUl_import_otch=UDl_import_otch*io_Lperc_down if sic87dd_up!=sic87dd_
> down
(161504 missing values generated)

->  gen GAUl_import_otch=UDl_import_otch*geo12
(161504 missing values generated)

->  gen GHUl_import_otch=UDl_import_otch*geo123
(161504 missing values generated)

-> 

->  gen ZTFUesfed=UDesfed*io_perc_down
(153664 missing values generated)

->  gen ZTLUesfed=UDesfed*io_Lperc_down
(153664 missing values generated)

->  gen ZDLUesfed=UDesfed*(1+io_Lperc_down) if sic87dd_up==sic87dd_down
(3219104 missing values generated)

->  gen ZNLUesfed=UDesfed*io_Lperc_down if sic87dd_up!=sic87dd_down
(161504 missing values generated)

->  gen GAUesfed=UDesfed*geo12
(161504 missing values generated)

->  gen GHUesfed=UDesfed*geo123
(161504 missing values generated)

-> 

->  gen ZTFUltfp4=UDltfp4*io_perc_down
(496664 missing values generated)

->  gen ZTLUltfp4=UDltfp4*io_Lperc_down
(496664 missing values generated)

->  gen ZDLUltfp4=UDltfp4*(1+io_Lperc_down) if sic87dd_up==sic87dd_down
(3219979 missing values generated)

->  gen ZNLUltfp4=UDltfp4*io_Lperc_down if sic87dd_up!=sic87dd_down
(503629 missing values generated)

->  gen GAUltfp4=UDltfp4*geo12
(503629 missing values generated)

->  gen GHUltfp4=UDltfp4*geo123
(503629 missing values generated)

-> 

->  gen ZTFUltfp5=UDltfp5*io_perc_down
(496664 missing values generated)

->  gen ZTLUltfp5=UDltfp5*io_Lperc_down
(496664 missing values generated)

->  gen ZDLUltfp5=UDltfp5*(1+io_Lperc_down) if sic87dd_up==sic87dd_down
(3219979 missing values generated)

->  gen ZNLUltfp5=UDltfp5*io_Lperc_down if sic87dd_up!=sic87dd_down
(503629 missing values generated)

->  gen GAUltfp5=UDltfp5*geo12
(503629 missing values generated)

->  gen GHUltfp5=UDltfp5*geo123
(503629 missing values generated)

-> 

->  gen ZTFUlfmct=UDlfmct*io_perc_down
(621320 missing values generated)

->  gen ZTLUlfmct=UDlfmct*io_Lperc_down
(621320 missing values generated)

->  gen ZDLUlfmct=UDlfmct*(1+io_Lperc_down) if sic87dd_up==sic87dd_down
(3220297 missing values generated)

->  gen ZNLUlfmct=UDlfmct*io_Lperc_down if sic87dd_up!=sic87dd_down
(627967 missing values generated)

->  gen GAUlfmct=UDlfmct*geo12
(627967 missing values generated)

->  gen GHUlfmct=UDlfmct*geo123
(627967 missing values generated)

-> 

->  gen ZTFUlfuct=UDlfuct*io_perc_down
(621320 missing values generated)

->  gen ZTLUlfuct=UDlfuct*io_Lperc_down
(621320 missing values generated)

->  gen ZDLUlfuct=UDlfuct*(1+io_Lperc_down) if sic87dd_up==sic87dd_down
(3220297 missing values generated)

->  gen ZNLUlfuct=UDlfuct*io_Lperc_down if sic87dd_up!=sic87dd_down
(627967 missing values generated)

->  gen GAUlfuct=UDlfuct*geo12
(627967 missing values generated)

->  gen GHUlfuct=UDlfuct*geo123
(627967 missing values generated)
(note: file ./temp/sh-tr-upstream.dta not found)
file ./temp/sh-tr-upstream.dta saved
(note: you are using old merge syntax; see [D] merge for new syntax)
variable year does not uniquely identify observations in the master data

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    307,328        9.52        9.52
          3 |  2,919,616       90.48      100.00
------------+-----------------------------------
      Total |  3,226,944      100.00

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        MULT |   3226944     .002551    .0045352          0   .0347546
(8232 real changes made)

-> 

->  gen ZTFDzlnber_rvadd=DDzlnber_rvadd*io_perc_up
(501760 missing values generated)

->  gen ZTLDzlnber_rvadd=DDzlnber_rvadd*io_Lperc_up
(501760 missing values generated)

->  gen ZDLDzlnber_rvadd=DDzlnber_rvadd*(1+io_Lperc_up) if sic87dd_up==sic87dd_
> down
(3219992 missing values generated)

->  gen ZNLDzlnber_rvadd=DDzlnber_rvadd*io_Lperc_up if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GADzlnber_rvadd=DDzlnber_rvadd*geo12
(508712 missing values generated)

->  gen GHDzlnber_rvadd=DDzlnber_rvadd*geo123
(508712 missing values generated)

-> 

->  gen ZTFDzlnber_sales=DDzlnber_sales*io_perc_up
(501760 missing values generated)

->  gen ZTLDzlnber_sales=DDzlnber_sales*io_Lperc_up
(501760 missing values generated)

->  gen ZDLDzlnber_sales=DDzlnber_sales*(1+io_Lperc_up) if sic87dd_up==sic87dd_
> down
(3219992 missing values generated)

->  gen ZNLDzlnber_sales=DDzlnber_sales*io_Lperc_up if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GADzlnber_sales=DDzlnber_sales*geo12
(508712 missing values generated)

->  gen GHDzlnber_sales=DDzlnber_sales*geo123
(508712 missing values generated)

-> 

->  gen ZTFDzlnber_rsales=DDzlnber_rsales*io_perc_up
(501760 missing values generated)

->  gen ZTLDzlnber_rsales=DDzlnber_rsales*io_Lperc_up
(501760 missing values generated)

->  gen ZDLDzlnber_rsales=DDzlnber_rsales*(1+io_Lperc_up) if sic87dd_up==sic87d
> d_down
(3219992 missing values generated)

->  gen ZNLDzlnber_rsales=DDzlnber_rsales*io_Lperc_up if sic87dd_up!=sic87dd_do
> wn
(508712 missing values generated)

->  gen GADzlnber_rsales=DDzlnber_rsales*geo12
(508712 missing values generated)

->  gen GHDzlnber_rsales=DDzlnber_rsales*geo123
(508712 missing values generated)

-> 

->  gen ZTFDzlnber_emp=DDzlnber_emp*io_perc_up
(501760 missing values generated)

->  gen ZTLDzlnber_emp=DDzlnber_emp*io_Lperc_up
(501760 missing values generated)

->  gen ZDLDzlnber_emp=DDzlnber_emp*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
(3219992 missing values generated)

->  gen ZNLDzlnber_emp=DDzlnber_emp*io_Lperc_up if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GADzlnber_emp=DDzlnber_emp*geo12
(508712 missing values generated)

->  gen GHDzlnber_emp=DDzlnber_emp*geo123
(508712 missing values generated)

-> 

->  gen ZTFDlnber_rvadd=DDlnber_rvadd*io_perc_up
(501760 missing values generated)

->  gen ZTLDlnber_rvadd=DDlnber_rvadd*io_Lperc_up
(501760 missing values generated)

->  gen ZDLDlnber_rvadd=DDlnber_rvadd*(1+io_Lperc_up) if sic87dd_up==sic87dd_do
> wn
(3219992 missing values generated)

->  gen ZNLDlnber_rvadd=DDlnber_rvadd*io_Lperc_up if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GADlnber_rvadd=DDlnber_rvadd*geo12
(508712 missing values generated)

->  gen GHDlnber_rvadd=DDlnber_rvadd*geo123
(508712 missing values generated)

-> 

->  gen ZTFDlnber_emp=DDlnber_emp*io_perc_up
(501760 missing values generated)

->  gen ZTLDlnber_emp=DDlnber_emp*io_Lperc_up
(501760 missing values generated)

->  gen ZDLDlnber_emp=DDlnber_emp*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
(3219992 missing values generated)

->  gen ZNLDlnber_emp=DDlnber_emp*io_Lperc_up if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GADlnber_emp=DDlnber_emp*geo12
(508712 missing values generated)

->  gen GHDlnber_emp=DDlnber_emp*geo123
(508712 missing values generated)

-> 

->  gen ZTFDlnber_rlprod=DDlnber_rlprod*io_perc_up
(501760 missing values generated)

->  gen ZTLDlnber_rlprod=DDlnber_rlprod*io_Lperc_up
(501760 missing values generated)

->  gen ZDLDlnber_rlprod=DDlnber_rlprod*(1+io_Lperc_up) if sic87dd_up==sic87dd_
> down
(3219992 missing values generated)

->  gen ZNLDlnber_rlprod=DDlnber_rlprod*io_Lperc_up if sic87dd_up!=sic87dd_down
(508712 missing values generated)

->  gen GADlnber_rlprod=DDlnber_rlprod*geo12
(508712 missing values generated)

->  gen GHDlnber_rlprod=DDlnber_rlprod*geo123
(508712 missing values generated)

-> 

->  gen ZTFDl_import_usch=DDl_import_usch*io_perc_up
(153664 missing values generated)

->  gen ZTLDl_import_usch=DDl_import_usch*io_Lperc_up
(153664 missing values generated)

->  gen ZDLDl_import_usch=DDl_import_usch*(1+io_Lperc_up) if sic87dd_up==sic87d
> d_down
(3219104 missing values generated)

->  gen ZNLDl_import_usch=DDl_import_usch*io_Lperc_up if sic87dd_up!=sic87dd_do
> wn
(161504 missing values generated)

->  gen GADl_import_usch=DDl_import_usch*geo12
(161504 missing values generated)

->  gen GHDl_import_usch=DDl_import_usch*geo123
(161504 missing values generated)

-> 

->  gen ZTFDl_import_otch=DDl_import_otch*io_perc_up
(153664 missing values generated)

->  gen ZTLDl_import_otch=DDl_import_otch*io_Lperc_up
(153664 missing values generated)

->  gen ZDLDl_import_otch=DDl_import_otch*(1+io_Lperc_up) if sic87dd_up==sic87d
> d_down
(3219104 missing values generated)

->  gen ZNLDl_import_otch=DDl_import_otch*io_Lperc_up if sic87dd_up!=sic87dd_do
> wn
(161504 missing values generated)

->  gen GADl_import_otch=DDl_import_otch*geo12
(161504 missing values generated)

->  gen GHDl_import_otch=DDl_import_otch*geo123
(161504 missing values generated)

-> 

->  gen ZTFDesfed=DDesfed*io_perc_up
(153664 missing values generated)

->  gen ZTLDesfed=DDesfed*io_Lperc_up
(153664 missing values generated)

->  gen ZDLDesfed=DDesfed*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
(3219104 missing values generated)

->  gen ZNLDesfed=DDesfed*io_Lperc_up if sic87dd_up!=sic87dd_down
(161504 missing values generated)

->  gen GADesfed=DDesfed*geo12
(161504 missing values generated)

->  gen GHDesfed=DDesfed*geo123
(161504 missing values generated)

-> 

->  gen ZTFDltfp4=DDltfp4*io_perc_up
(496664 missing values generated)

->  gen ZTLDltfp4=DDltfp4*io_Lperc_up
(496664 missing values generated)

->  gen ZDLDltfp4=DDltfp4*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
(3219979 missing values generated)

->  gen ZNLDltfp4=DDltfp4*io_Lperc_up if sic87dd_up!=sic87dd_down
(503629 missing values generated)

->  gen GADltfp4=DDltfp4*geo12
(503629 missing values generated)

->  gen GHDltfp4=DDltfp4*geo123
(503629 missing values generated)

-> 

->  gen ZTFDltfp5=DDltfp5*io_perc_up
(496664 missing values generated)

->  gen ZTLDltfp5=DDltfp5*io_Lperc_up
(496664 missing values generated)

->  gen ZDLDltfp5=DDltfp5*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
(3219979 missing values generated)

->  gen ZNLDltfp5=DDltfp5*io_Lperc_up if sic87dd_up!=sic87dd_down
(503629 missing values generated)

->  gen GADltfp5=DDltfp5*geo12
(503629 missing values generated)

->  gen GHDltfp5=DDltfp5*geo123
(503629 missing values generated)

-> 

->  gen ZTFDlfmct=DDlfmct*io_perc_up
(621320 missing values generated)

->  gen ZTLDlfmct=DDlfmct*io_Lperc_up
(621320 missing values generated)

->  gen ZDLDlfmct=DDlfmct*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
(3220297 missing values generated)

->  gen ZNLDlfmct=DDlfmct*io_Lperc_up if sic87dd_up!=sic87dd_down
(627967 missing values generated)

->  gen GADlfmct=DDlfmct*geo12
(627967 missing values generated)

->  gen GHDlfmct=DDlfmct*geo123
(627967 missing values generated)

-> 

->  gen ZTFDlfuct=DDlfuct*io_perc_up
(621320 missing values generated)

->  gen ZTLDlfuct=DDlfuct*io_Lperc_up
(621320 missing values generated)

->  gen ZDLDlfuct=DDlfuct*(1+io_Lperc_up) if sic87dd_up==sic87dd_down
(3220297 missing values generated)

->  gen ZNLDlfuct=DDlfuct*io_Lperc_up if sic87dd_up!=sic87dd_down
(627967 missing values generated)

->  gen GADlfuct=DDlfuct*geo12
(627967 missing values generated)

->  gen GHDlfuct=DDlfuct*geo123
(627967 missing values generated)
(818496 missing values generated)
(818496 missing values generated)
(517440 missing values generated)
(note: you are using old merge syntax; see [D] merge for new syntax)
(note: file ./temp/shock-stimulus-temp.dta not found)
file ./temp/shock-stimulus-temp.dta saved

->  ren Dzlnber_rvadd DOzlnber_rvadd

->  ren Dzlnber_sales DOzlnber_sales

->  ren Dzlnber_rsales DOzlnber_rsales

->  ren Dzlnber_emp DOzlnber_emp

->  ren Dlnber_rvadd DOlnber_rvadd

->  ren Dlnber_emp DOlnber_emp

->  ren Dlnber_rlprod DOlnber_rlprod

->  ren Dl_import_usch DOl_import_usch

->  ren Dl_import_otch DOl_import_otch

->  ren Desfed DOesfed

->  ren Dltfp4 DOltfp4

->  ren Dltfp5 DOltfp5

->  ren Dlfmct DOlfmct

->  ren Dlfuct DOlfuct
(note: you are using old merge syntax; see [D] merge for new syntax)
       panel variable:  sic87dd (strongly balanced)
        time variable:  year, 1991 to 2011
                delta:  1 unit

->  gen DOzlnber_rvadd_l0=DOzlnber_rvadd
(1280 missing values generated)

->  gen DOzlnber_rvadd_l1=l1.DOzlnber_rvadd
(1280 missing values generated)

->  gen DOzlnber_rvadd_l2=l2.DOzlnber_rvadd
(1280 missing values generated)

->  gen DOzlnber_rvadd_l3=l3.DOzlnber_rvadd
(1664 missing values generated)

->  gen DOzlnber_sales_l0=DOzlnber_sales
(1280 missing values generated)

->  gen DOzlnber_sales_l1=l1.DOzlnber_sales
(1280 missing values generated)

->  gen DOzlnber_sales_l2=l2.DOzlnber_sales
(1280 missing values generated)

->  gen DOzlnber_sales_l3=l3.DOzlnber_sales
(1664 missing values generated)

->  gen DOzlnber_rsales_l0=DOzlnber_rsales
(1280 missing values generated)

->  gen DOzlnber_rsales_l1=l1.DOzlnber_rsales
(1280 missing values generated)

->  gen DOzlnber_rsales_l2=l2.DOzlnber_rsales
(1280 missing values generated)

->  gen DOzlnber_rsales_l3=l3.DOzlnber_rsales
(1664 missing values generated)

->  gen DOzlnber_emp_l0=DOzlnber_emp
(1280 missing values generated)

->  gen DOzlnber_emp_l1=l1.DOzlnber_emp
(1280 missing values generated)

->  gen DOzlnber_emp_l2=l2.DOzlnber_emp
(1280 missing values generated)

->  gen DOzlnber_emp_l3=l3.DOzlnber_emp
(1664 missing values generated)

->  gen DOl_import_usch_l0=DOl_import_usch
(392 missing values generated)

->  gen DOl_import_usch_l1=l1.DOl_import_usch
(784 missing values generated)

->  gen DOl_import_usch_l2=l2.DOl_import_usch
(1176 missing values generated)

->  gen DOl_import_usch_l3=l3.DOl_import_usch
(1568 missing values generated)

->  gen DOl_import_otch_l0=DOl_import_otch
(392 missing values generated)

->  gen DOl_import_otch_l1=l1.DOl_import_otch
(784 missing values generated)

->  gen DOl_import_otch_l2=l2.DOl_import_otch
(1176 missing values generated)

->  gen DOl_import_otch_l3=l3.DOl_import_otch
(1568 missing values generated)

->  gen DOesfed_l0=DOesfed
(392 missing values generated)

->  gen DOesfed_l1=l1.DOesfed
(784 missing values generated)

->  gen DOesfed_l2=l2.DOesfed
(1176 missing values generated)

->  gen DOesfed_l3=l3.DOesfed
(1568 missing values generated)

->  gen DOltfp4_l0=DOltfp4
(1267 missing values generated)

->  gen DOltfp4_l1=l1.DOltfp4
(1267 missing values generated)

->  gen DOltfp4_l2=l2.DOltfp4
(1267 missing values generated)

->  gen DOltfp4_l3=l3.DOltfp4
(1652 missing values generated)

->  gen DOltfp5_l0=DOltfp5
(1267 missing values generated)

->  gen DOltfp5_l1=l1.DOltfp5
(1267 missing values generated)

->  gen DOltfp5_l2=l2.DOltfp5
(1267 missing values generated)

->  gen DOltfp5_l3=l3.DOltfp5
(1652 missing values generated)

->  gen DOlfmct_l0=DOlfmct
(1585 missing values generated)

->  gen DOlfmct_l1=l1.DOlfmct
(1585 missing values generated)

->  gen DOlfmct_l2=l2.DOlfmct
(1585 missing values generated)

->  gen DOlfmct_l3=l3.DOlfmct
(1585 missing values generated)

->  gen DOlfuct_l0=DOlfuct
(1585 missing values generated)

->  gen DOlfuct_l1=l1.DOlfuct
(1585 missing values generated)

->  gen DOlfuct_l2=l2.DOlfuct
(1585 missing values generated)

->  gen DOlfuct_l3=l3.DOlfuct
(1585 missing values generated)

->  gen Dlnber_emp_l0=Dlnber_emp
(1280 missing values generated)

->  gen Dlnber_emp_l1=l1.Dlnber_emp
(1280 missing values generated)

->  gen Dlnber_emp_l2=l2.Dlnber_emp
(1280 missing values generated)

->  gen Dlnber_emp_l3=l3.Dlnber_emp
(1664 missing values generated)

->  gen Dlnber_vadd_l0=Dlnber_vadd
(1280 missing values generated)

->  gen Dlnber_vadd_l1=l1.Dlnber_vadd
(1280 missing values generated)

->  gen Dlnber_vadd_l2=l2.Dlnber_vadd
(1280 missing values generated)

->  gen Dlnber_vadd_l3=l3.Dlnber_vadd
(1664 missing values generated)

->  gen Dlnber_sales_l0=Dlnber_sales
(1280 missing values generated)

->  gen Dlnber_sales_l1=l1.Dlnber_sales
(1280 missing values generated)

->  gen Dlnber_sales_l2=l2.Dlnber_sales
(1280 missing values generated)

->  gen Dlnber_sales_l3=l3.Dlnber_sales
(1664 missing values generated)

->  gen Dlnber_rvadd_l0=Dlnber_rvadd
(1280 missing values generated)

->  gen Dlnber_rvadd_l1=l1.Dlnber_rvadd
(1280 missing values generated)

->  gen Dlnber_rvadd_l2=l2.Dlnber_rvadd
(1280 missing values generated)

->  gen Dlnber_rvadd_l3=l3.Dlnber_rvadd
(1664 missing values generated)

->  gen Dlnber_rsales_l0=Dlnber_rsales
(1280 missing values generated)

->  gen Dlnber_rsales_l1=l1.Dlnber_rsales
(1280 missing values generated)

->  gen Dlnber_rsales_l2=l2.Dlnber_rsales
(1280 missing values generated)

->  gen Dlnber_rsales_l3=l3.Dlnber_rsales
(1664 missing values generated)

->  gen Dlnber_lprod_l0=Dlnber_lprod
(1280 missing values generated)

->  gen Dlnber_lprod_l1=l1.Dlnber_lprod
(1280 missing values generated)

->  gen Dlnber_lprod_l2=l2.Dlnber_lprod
(1280 missing values generated)

->  gen Dlnber_lprod_l3=l3.Dlnber_lprod
(1664 missing values generated)

->  gen Dlnber_rlprod_l0=Dlnber_rlprod
(1280 missing values generated)

->  gen Dlnber_rlprod_l1=l1.Dlnber_rlprod
(1280 missing values generated)

->  gen Dlnber_rlprod_l2=l2.Dlnber_rlprod
(1280 missing values generated)

->  gen Dlnber_rlprod_l3=l3.Dlnber_rlprod
(1664 missing values generated)

->  gen DZTFDzlnber_rvadd_l0=ZTFDzlnber_rvadd

->  gen DZTFDzlnber_rvadd_l1=l1.ZTFDzlnber_rvadd
(392 missing values generated)

->  gen DZTFDzlnber_rvadd_l2=l2.ZTFDzlnber_rvadd
(784 missing values generated)

->  gen DZTFDzlnber_rvadd_l3=l3.ZTFDzlnber_rvadd
(1176 missing values generated)

->  gen DZTLDzlnber_rvadd_l0=ZTLDzlnber_rvadd

->  gen DZTLDzlnber_rvadd_l1=l1.ZTLDzlnber_rvadd
(392 missing values generated)

->  gen DZTLDzlnber_rvadd_l2=l2.ZTLDzlnber_rvadd
(784 missing values generated)

->  gen DZTLDzlnber_rvadd_l3=l3.ZTLDzlnber_rvadd
(1176 missing values generated)

->  gen DZDLDzlnber_rvadd_l0=ZDLDzlnber_rvadd

->  gen DZDLDzlnber_rvadd_l1=l1.ZDLDzlnber_rvadd
(392 missing values generated)

->  gen DZDLDzlnber_rvadd_l2=l2.ZDLDzlnber_rvadd
(784 missing values generated)

->  gen DZDLDzlnber_rvadd_l3=l3.ZDLDzlnber_rvadd
(1176 missing values generated)

->  gen DZNLDzlnber_rvadd_l0=ZNLDzlnber_rvadd

->  gen DZNLDzlnber_rvadd_l1=l1.ZNLDzlnber_rvadd
(392 missing values generated)

->  gen DZNLDzlnber_rvadd_l2=l2.ZNLDzlnber_rvadd
(784 missing values generated)

->  gen DZNLDzlnber_rvadd_l3=l3.ZNLDzlnber_rvadd
(1176 missing values generated)

->  gen DZTFDzlnber_sales_l0=ZTFDzlnber_sales

->  gen DZTFDzlnber_sales_l1=l1.ZTFDzlnber_sales
(392 missing values generated)

->  gen DZTFDzlnber_sales_l2=l2.ZTFDzlnber_sales
(784 missing values generated)

->  gen DZTFDzlnber_sales_l3=l3.ZTFDzlnber_sales
(1176 missing values generated)

->  gen DZTLDzlnber_sales_l0=ZTLDzlnber_sales

->  gen DZTLDzlnber_sales_l1=l1.ZTLDzlnber_sales
(392 missing values generated)

->  gen DZTLDzlnber_sales_l2=l2.ZTLDzlnber_sales
(784 missing values generated)

->  gen DZTLDzlnber_sales_l3=l3.ZTLDzlnber_sales
(1176 missing values generated)

->  gen DZDLDzlnber_sales_l0=ZDLDzlnber_sales

->  gen DZDLDzlnber_sales_l1=l1.ZDLDzlnber_sales
(392 missing values generated)

->  gen DZDLDzlnber_sales_l2=l2.ZDLDzlnber_sales
(784 missing values generated)

->  gen DZDLDzlnber_sales_l3=l3.ZDLDzlnber_sales
(1176 missing values generated)

->  gen DZNLDzlnber_sales_l0=ZNLDzlnber_sales

->  gen DZNLDzlnber_sales_l1=l1.ZNLDzlnber_sales
(392 missing values generated)

->  gen DZNLDzlnber_sales_l2=l2.ZNLDzlnber_sales
(784 missing values generated)

->  gen DZNLDzlnber_sales_l3=l3.ZNLDzlnber_sales
(1176 missing values generated)

->  gen DZTFDzlnber_rsales_l0=ZTFDzlnber_rsales

->  gen DZTFDzlnber_rsales_l1=l1.ZTFDzlnber_rsales
(392 missing values generated)

->  gen DZTFDzlnber_rsales_l2=l2.ZTFDzlnber_rsales
(784 missing values generated)

->  gen DZTFDzlnber_rsales_l3=l3.ZTFDzlnber_rsales
(1176 missing values generated)

->  gen DZTLDzlnber_rsales_l0=ZTLDzlnber_rsales

->  gen DZTLDzlnber_rsales_l1=l1.ZTLDzlnber_rsales
(392 missing values generated)

->  gen DZTLDzlnber_rsales_l2=l2.ZTLDzlnber_rsales
(784 missing values generated)

->  gen DZTLDzlnber_rsales_l3=l3.ZTLDzlnber_rsales
(1176 missing values generated)

->  gen DZDLDzlnber_rsales_l0=ZDLDzlnber_rsales

->  gen DZDLDzlnber_rsales_l1=l1.ZDLDzlnber_rsales
(392 missing values generated)

->  gen DZDLDzlnber_rsales_l2=l2.ZDLDzlnber_rsales
(784 missing values generated)

->  gen DZDLDzlnber_rsales_l3=l3.ZDLDzlnber_rsales
(1176 missing values generated)

->  gen DZNLDzlnber_rsales_l0=ZNLDzlnber_rsales

->  gen DZNLDzlnber_rsales_l1=l1.ZNLDzlnber_rsales
(392 missing values generated)

->  gen DZNLDzlnber_rsales_l2=l2.ZNLDzlnber_rsales
(784 missing values generated)

->  gen DZNLDzlnber_rsales_l3=l3.ZNLDzlnber_rsales
(1176 missing values generated)

->  gen DZTFDzlnber_emp_l0=ZTFDzlnber_emp

->  gen DZTFDzlnber_emp_l1=l1.ZTFDzlnber_emp
(392 missing values generated)

->  gen DZTFDzlnber_emp_l2=l2.ZTFDzlnber_emp
(784 missing values generated)

->  gen DZTFDzlnber_emp_l3=l3.ZTFDzlnber_emp
(1176 missing values generated)

->  gen DZTLDzlnber_emp_l0=ZTLDzlnber_emp

->  gen DZTLDzlnber_emp_l1=l1.ZTLDzlnber_emp
(392 missing values generated)

->  gen DZTLDzlnber_emp_l2=l2.ZTLDzlnber_emp
(784 missing values generated)

->  gen DZTLDzlnber_emp_l3=l3.ZTLDzlnber_emp
(1176 missing values generated)

->  gen DZDLDzlnber_emp_l0=ZDLDzlnber_emp

->  gen DZDLDzlnber_emp_l1=l1.ZDLDzlnber_emp
(392 missing values generated)

->  gen DZDLDzlnber_emp_l2=l2.ZDLDzlnber_emp
(784 missing values generated)

->  gen DZDLDzlnber_emp_l3=l3.ZDLDzlnber_emp
(1176 missing values generated)

->  gen DZNLDzlnber_emp_l0=ZNLDzlnber_emp

->  gen DZNLDzlnber_emp_l1=l1.ZNLDzlnber_emp
(392 missing values generated)

->  gen DZNLDzlnber_emp_l2=l2.ZNLDzlnber_emp
(784 missing values generated)

->  gen DZNLDzlnber_emp_l3=l3.ZNLDzlnber_emp
(1176 missing values generated)

->  gen DZTFDlnber_rvadd_l0=ZTFDlnber_rvadd

->  gen DZTFDlnber_rvadd_l1=l1.ZTFDlnber_rvadd
(392 missing values generated)

->  gen DZTFDlnber_rvadd_l2=l2.ZTFDlnber_rvadd
(784 missing values generated)

->  gen DZTFDlnber_rvadd_l3=l3.ZTFDlnber_rvadd
(1176 missing values generated)

->  gen DZTLDlnber_rvadd_l0=ZTLDlnber_rvadd

->  gen DZTLDlnber_rvadd_l1=l1.ZTLDlnber_rvadd
(392 missing values generated)

->  gen DZTLDlnber_rvadd_l2=l2.ZTLDlnber_rvadd
(784 missing values generated)

->  gen DZTLDlnber_rvadd_l3=l3.ZTLDlnber_rvadd
(1176 missing values generated)

->  gen DZDLDlnber_rvadd_l0=ZDLDlnber_rvadd

->  gen DZDLDlnber_rvadd_l1=l1.ZDLDlnber_rvadd
(392 missing values generated)

->  gen DZDLDlnber_rvadd_l2=l2.ZDLDlnber_rvadd
(784 missing values generated)

->  gen DZDLDlnber_rvadd_l3=l3.ZDLDlnber_rvadd
(1176 missing values generated)

->  gen DZNLDlnber_rvadd_l0=ZNLDlnber_rvadd

->  gen DZNLDlnber_rvadd_l1=l1.ZNLDlnber_rvadd
(392 missing values generated)

->  gen DZNLDlnber_rvadd_l2=l2.ZNLDlnber_rvadd
(784 missing values generated)

->  gen DZNLDlnber_rvadd_l3=l3.ZNLDlnber_rvadd
(1176 missing values generated)

->  gen DZTFDlnber_emp_l0=ZTFDlnber_emp

->  gen DZTFDlnber_emp_l1=l1.ZTFDlnber_emp
(392 missing values generated)

->  gen DZTFDlnber_emp_l2=l2.ZTFDlnber_emp
(784 missing values generated)

->  gen DZTFDlnber_emp_l3=l3.ZTFDlnber_emp
(1176 missing values generated)

->  gen DZTLDlnber_emp_l0=ZTLDlnber_emp

->  gen DZTLDlnber_emp_l1=l1.ZTLDlnber_emp
(392 missing values generated)

->  gen DZTLDlnber_emp_l2=l2.ZTLDlnber_emp
(784 missing values generated)

->  gen DZTLDlnber_emp_l3=l3.ZTLDlnber_emp
(1176 missing values generated)

->  gen DZDLDlnber_emp_l0=ZDLDlnber_emp

->  gen DZDLDlnber_emp_l1=l1.ZDLDlnber_emp
(392 missing values generated)

->  gen DZDLDlnber_emp_l2=l2.ZDLDlnber_emp
(784 missing values generated)

->  gen DZDLDlnber_emp_l3=l3.ZDLDlnber_emp
(1176 missing values generated)

->  gen DZNLDlnber_emp_l0=ZNLDlnber_emp

->  gen DZNLDlnber_emp_l1=l1.ZNLDlnber_emp
(392 missing values generated)

->  gen DZNLDlnber_emp_l2=l2.ZNLDlnber_emp
(784 missing values generated)

->  gen DZNLDlnber_emp_l3=l3.ZNLDlnber_emp
(1176 missing values generated)

->  gen DZTFDlnber_rlprod_l0=ZTFDlnber_rlprod

->  gen DZTFDlnber_rlprod_l1=l1.ZTFDlnber_rlprod
(392 missing values generated)

->  gen DZTFDlnber_rlprod_l2=l2.ZTFDlnber_rlprod
(784 missing values generated)

->  gen DZTFDlnber_rlprod_l3=l3.ZTFDlnber_rlprod
(1176 missing values generated)

->  gen DZTLDlnber_rlprod_l0=ZTLDlnber_rlprod

->  gen DZTLDlnber_rlprod_l1=l1.ZTLDlnber_rlprod
(392 missing values generated)

->  gen DZTLDlnber_rlprod_l2=l2.ZTLDlnber_rlprod
(784 missing values generated)

->  gen DZTLDlnber_rlprod_l3=l3.ZTLDlnber_rlprod
(1176 missing values generated)

->  gen DZDLDlnber_rlprod_l0=ZDLDlnber_rlprod

->  gen DZDLDlnber_rlprod_l1=l1.ZDLDlnber_rlprod
(392 missing values generated)

->  gen DZDLDlnber_rlprod_l2=l2.ZDLDlnber_rlprod
(784 missing values generated)

->  gen DZDLDlnber_rlprod_l3=l3.ZDLDlnber_rlprod
(1176 missing values generated)

->  gen DZNLDlnber_rlprod_l0=ZNLDlnber_rlprod

->  gen DZNLDlnber_rlprod_l1=l1.ZNLDlnber_rlprod
(392 missing values generated)

->  gen DZNLDlnber_rlprod_l2=l2.ZNLDlnber_rlprod
(784 missing values generated)

->  gen DZNLDlnber_rlprod_l3=l3.ZNLDlnber_rlprod
(1176 missing values generated)

->  gen DZTFDl_import_usch_l0=ZTFDl_import_usch

->  gen DZTFDl_import_usch_l1=l1.ZTFDl_import_usch
(392 missing values generated)

->  gen DZTFDl_import_usch_l2=l2.ZTFDl_import_usch
(784 missing values generated)

->  gen DZTFDl_import_usch_l3=l3.ZTFDl_import_usch
(1176 missing values generated)

->  gen DZTLDl_import_usch_l0=ZTLDl_import_usch

->  gen DZTLDl_import_usch_l1=l1.ZTLDl_import_usch
(392 missing values generated)

->  gen DZTLDl_import_usch_l2=l2.ZTLDl_import_usch
(784 missing values generated)

->  gen DZTLDl_import_usch_l3=l3.ZTLDl_import_usch
(1176 missing values generated)

->  gen DZDLDl_import_usch_l0=ZDLDl_import_usch

->  gen DZDLDl_import_usch_l1=l1.ZDLDl_import_usch
(392 missing values generated)

->  gen DZDLDl_import_usch_l2=l2.ZDLDl_import_usch
(784 missing values generated)

->  gen DZDLDl_import_usch_l3=l3.ZDLDl_import_usch
(1176 missing values generated)

->  gen DZNLDl_import_usch_l0=ZNLDl_import_usch

->  gen DZNLDl_import_usch_l1=l1.ZNLDl_import_usch
(392 missing values generated)

->  gen DZNLDl_import_usch_l2=l2.ZNLDl_import_usch
(784 missing values generated)

->  gen DZNLDl_import_usch_l3=l3.ZNLDl_import_usch
(1176 missing values generated)

->  gen DZTFDl_import_otch_l0=ZTFDl_import_otch

->  gen DZTFDl_import_otch_l1=l1.ZTFDl_import_otch
(392 missing values generated)

->  gen DZTFDl_import_otch_l2=l2.ZTFDl_import_otch
(784 missing values generated)

->  gen DZTFDl_import_otch_l3=l3.ZTFDl_import_otch
(1176 missing values generated)

->  gen DZTLDl_import_otch_l0=ZTLDl_import_otch

->  gen DZTLDl_import_otch_l1=l1.ZTLDl_import_otch
(392 missing values generated)

->  gen DZTLDl_import_otch_l2=l2.ZTLDl_import_otch
(784 missing values generated)

->  gen DZTLDl_import_otch_l3=l3.ZTLDl_import_otch
(1176 missing values generated)

->  gen DZDLDl_import_otch_l0=ZDLDl_import_otch

->  gen DZDLDl_import_otch_l1=l1.ZDLDl_import_otch
(392 missing values generated)

->  gen DZDLDl_import_otch_l2=l2.ZDLDl_import_otch
(784 missing values generated)

->  gen DZDLDl_import_otch_l3=l3.ZDLDl_import_otch
(1176 missing values generated)

->  gen DZNLDl_import_otch_l0=ZNLDl_import_otch

->  gen DZNLDl_import_otch_l1=l1.ZNLDl_import_otch
(392 missing values generated)

->  gen DZNLDl_import_otch_l2=l2.ZNLDl_import_otch
(784 missing values generated)

->  gen DZNLDl_import_otch_l3=l3.ZNLDl_import_otch
(1176 missing values generated)

->  gen DZTFDesfed_l0=ZTFDesfed

->  gen DZTFDesfed_l1=l1.ZTFDesfed
(392 missing values generated)

->  gen DZTFDesfed_l2=l2.ZTFDesfed
(784 missing values generated)

->  gen DZTFDesfed_l3=l3.ZTFDesfed
(1176 missing values generated)

->  gen DZTLDesfed_l0=ZTLDesfed

->  gen DZTLDesfed_l1=l1.ZTLDesfed
(392 missing values generated)

->  gen DZTLDesfed_l2=l2.ZTLDesfed
(784 missing values generated)

->  gen DZTLDesfed_l3=l3.ZTLDesfed
(1176 missing values generated)

->  gen DZDLDesfed_l0=ZDLDesfed

->  gen DZDLDesfed_l1=l1.ZDLDesfed
(392 missing values generated)

->  gen DZDLDesfed_l2=l2.ZDLDesfed
(784 missing values generated)

->  gen DZDLDesfed_l3=l3.ZDLDesfed
(1176 missing values generated)

->  gen DZNLDesfed_l0=ZNLDesfed

->  gen DZNLDesfed_l1=l1.ZNLDesfed
(392 missing values generated)

->  gen DZNLDesfed_l2=l2.ZNLDesfed
(784 missing values generated)

->  gen DZNLDesfed_l3=l3.ZNLDesfed
(1176 missing values generated)

->  gen DZTFDltfp4_l0=ZTFDltfp4

->  gen DZTFDltfp4_l1=l1.ZTFDltfp4
(392 missing values generated)

->  gen DZTFDltfp4_l2=l2.ZTFDltfp4
(784 missing values generated)

->  gen DZTFDltfp4_l3=l3.ZTFDltfp4
(1176 missing values generated)

->  gen DZTLDltfp4_l0=ZTLDltfp4

->  gen DZTLDltfp4_l1=l1.ZTLDltfp4
(392 missing values generated)

->  gen DZTLDltfp4_l2=l2.ZTLDltfp4
(784 missing values generated)

->  gen DZTLDltfp4_l3=l3.ZTLDltfp4
(1176 missing values generated)

->  gen DZDLDltfp4_l0=ZDLDltfp4

->  gen DZDLDltfp4_l1=l1.ZDLDltfp4
(392 missing values generated)

->  gen DZDLDltfp4_l2=l2.ZDLDltfp4
(784 missing values generated)

->  gen DZDLDltfp4_l3=l3.ZDLDltfp4
(1176 missing values generated)

->  gen DZNLDltfp4_l0=ZNLDltfp4

->  gen DZNLDltfp4_l1=l1.ZNLDltfp4
(392 missing values generated)

->  gen DZNLDltfp4_l2=l2.ZNLDltfp4
(784 missing values generated)

->  gen DZNLDltfp4_l3=l3.ZNLDltfp4
(1176 missing values generated)

->  gen DZTFDltfp5_l0=ZTFDltfp5

->  gen DZTFDltfp5_l1=l1.ZTFDltfp5
(392 missing values generated)

->  gen DZTFDltfp5_l2=l2.ZTFDltfp5
(784 missing values generated)

->  gen DZTFDltfp5_l3=l3.ZTFDltfp5
(1176 missing values generated)

->  gen DZTLDltfp5_l0=ZTLDltfp5

->  gen DZTLDltfp5_l1=l1.ZTLDltfp5
(392 missing values generated)

->  gen DZTLDltfp5_l2=l2.ZTLDltfp5
(784 missing values generated)

->  gen DZTLDltfp5_l3=l3.ZTLDltfp5
(1176 missing values generated)

->  gen DZDLDltfp5_l0=ZDLDltfp5

->  gen DZDLDltfp5_l1=l1.ZDLDltfp5
(392 missing values generated)

->  gen DZDLDltfp5_l2=l2.ZDLDltfp5
(784 missing values generated)

->  gen DZDLDltfp5_l3=l3.ZDLDltfp5
(1176 missing values generated)

->  gen DZNLDltfp5_l0=ZNLDltfp5

->  gen DZNLDltfp5_l1=l1.ZNLDltfp5
(392 missing values generated)

->  gen DZNLDltfp5_l2=l2.ZNLDltfp5
(784 missing values generated)

->  gen DZNLDltfp5_l3=l3.ZNLDltfp5
(1176 missing values generated)

->  gen DZTFDlfmct_l0=ZTFDlfmct

->  gen DZTFDlfmct_l1=l1.ZTFDlfmct
(392 missing values generated)

->  gen DZTFDlfmct_l2=l2.ZTFDlfmct
(784 missing values generated)

->  gen DZTFDlfmct_l3=l3.ZTFDlfmct
(1176 missing values generated)

->  gen DZTLDlfmct_l0=ZTLDlfmct

->  gen DZTLDlfmct_l1=l1.ZTLDlfmct
(392 missing values generated)

->  gen DZTLDlfmct_l2=l2.ZTLDlfmct
(784 missing values generated)

->  gen DZTLDlfmct_l3=l3.ZTLDlfmct
(1176 missing values generated)

->  gen DZDLDlfmct_l0=ZDLDlfmct

->  gen DZDLDlfmct_l1=l1.ZDLDlfmct
(392 missing values generated)

->  gen DZDLDlfmct_l2=l2.ZDLDlfmct
(784 missing values generated)

->  gen DZDLDlfmct_l3=l3.ZDLDlfmct
(1176 missing values generated)

->  gen DZNLDlfmct_l0=ZNLDlfmct

->  gen DZNLDlfmct_l1=l1.ZNLDlfmct
(392 missing values generated)

->  gen DZNLDlfmct_l2=l2.ZNLDlfmct
(784 missing values generated)

->  gen DZNLDlfmct_l3=l3.ZNLDlfmct
(1176 missing values generated)

->  gen DZTFDlfuct_l0=ZTFDlfuct

->  gen DZTFDlfuct_l1=l1.ZTFDlfuct
(392 missing values generated)

->  gen DZTFDlfuct_l2=l2.ZTFDlfuct
(784 missing values generated)

->  gen DZTFDlfuct_l3=l3.ZTFDlfuct
(1176 missing values generated)

->  gen DZTLDlfuct_l0=ZTLDlfuct

->  gen DZTLDlfuct_l1=l1.ZTLDlfuct
(392 missing values generated)

->  gen DZTLDlfuct_l2=l2.ZTLDlfuct
(784 missing values generated)

->  gen DZTLDlfuct_l3=l3.ZTLDlfuct
(1176 missing values generated)

->  gen DZDLDlfuct_l0=ZDLDlfuct

->  gen DZDLDlfuct_l1=l1.ZDLDlfuct
(392 missing values generated)

->  gen DZDLDlfuct_l2=l2.ZDLDlfuct
(784 missing values generated)

->  gen DZDLDlfuct_l3=l3.ZDLDlfuct
(1176 missing values generated)

->  gen DZNLDlfuct_l0=ZNLDlfuct

->  gen DZNLDlfuct_l1=l1.ZNLDlfuct
(392 missing values generated)

->  gen DZNLDlfuct_l2=l2.ZNLDlfuct
(784 missing values generated)

->  gen DZNLDlfuct_l3=l3.ZNLDlfuct
(1176 missing values generated)

->  gen DZR4LDl_import_usch_l0=ZR4LDl_import_usch

->  gen DZR4LDl_import_usch_l1=l1.ZR4LDl_import_usch
(392 missing values generated)

->  gen DZR4LDl_import_usch_l2=l2.ZR4LDl_import_usch
(784 missing values generated)

->  gen DZR4LDl_import_usch_l3=l3.ZR4LDl_import_usch
(1176 missing values generated)

->  gen DZR4LDl_import_otch_l0=ZR4LDl_import_otch

->  gen DZR4LDl_import_otch_l1=l1.ZR4LDl_import_otch
(392 missing values generated)

->  gen DZR4LDl_import_otch_l2=l2.ZR4LDl_import_otch
(784 missing values generated)

->  gen DZR4LDl_import_otch_l3=l3.ZR4LDl_import_otch
(1176 missing values generated)

->  gen DZR4LDesfed_l0=ZR4LDesfed

->  gen DZR4LDesfed_l1=l1.ZR4LDesfed
(392 missing values generated)

->  gen DZR4LDesfed_l2=l2.ZR4LDesfed
(784 missing values generated)

->  gen DZR4LDesfed_l3=l3.ZR4LDesfed
(1176 missing values generated)

->  gen DZTFUzlnber_rvadd_l0=ZTFUzlnber_rvadd

->  gen DZTFUzlnber_rvadd_l1=l1.ZTFUzlnber_rvadd
(392 missing values generated)

->  gen DZTFUzlnber_rvadd_l2=l2.ZTFUzlnber_rvadd
(784 missing values generated)

->  gen DZTFUzlnber_rvadd_l3=l3.ZTFUzlnber_rvadd
(1176 missing values generated)

->  gen DZTLUzlnber_rvadd_l0=ZTLUzlnber_rvadd

->  gen DZTLUzlnber_rvadd_l1=l1.ZTLUzlnber_rvadd
(392 missing values generated)

->  gen DZTLUzlnber_rvadd_l2=l2.ZTLUzlnber_rvadd
(784 missing values generated)

->  gen DZTLUzlnber_rvadd_l3=l3.ZTLUzlnber_rvadd
(1176 missing values generated)

->  gen DZDLUzlnber_rvadd_l0=ZDLUzlnber_rvadd

->  gen DZDLUzlnber_rvadd_l1=l1.ZDLUzlnber_rvadd
(392 missing values generated)

->  gen DZDLUzlnber_rvadd_l2=l2.ZDLUzlnber_rvadd
(784 missing values generated)

->  gen DZDLUzlnber_rvadd_l3=l3.ZDLUzlnber_rvadd
(1176 missing values generated)

->  gen DZNLUzlnber_rvadd_l0=ZNLUzlnber_rvadd

->  gen DZNLUzlnber_rvadd_l1=l1.ZNLUzlnber_rvadd
(392 missing values generated)

->  gen DZNLUzlnber_rvadd_l2=l2.ZNLUzlnber_rvadd
(784 missing values generated)

->  gen DZNLUzlnber_rvadd_l3=l3.ZNLUzlnber_rvadd
(1176 missing values generated)

->  gen DZTFUzlnber_sales_l0=ZTFUzlnber_sales

->  gen DZTFUzlnber_sales_l1=l1.ZTFUzlnber_sales
(392 missing values generated)

->  gen DZTFUzlnber_sales_l2=l2.ZTFUzlnber_sales
(784 missing values generated)

->  gen DZTFUzlnber_sales_l3=l3.ZTFUzlnber_sales
(1176 missing values generated)

->  gen DZTLUzlnber_sales_l0=ZTLUzlnber_sales

->  gen DZTLUzlnber_sales_l1=l1.ZTLUzlnber_sales
(392 missing values generated)

->  gen DZTLUzlnber_sales_l2=l2.ZTLUzlnber_sales
(784 missing values generated)

->  gen DZTLUzlnber_sales_l3=l3.ZTLUzlnber_sales
(1176 missing values generated)

->  gen DZDLUzlnber_sales_l0=ZDLUzlnber_sales

->  gen DZDLUzlnber_sales_l1=l1.ZDLUzlnber_sales
(392 missing values generated)

->  gen DZDLUzlnber_sales_l2=l2.ZDLUzlnber_sales
(784 missing values generated)

->  gen DZDLUzlnber_sales_l3=l3.ZDLUzlnber_sales
(1176 missing values generated)

->  gen DZNLUzlnber_sales_l0=ZNLUzlnber_sales

->  gen DZNLUzlnber_sales_l1=l1.ZNLUzlnber_sales
(392 missing values generated)

->  gen DZNLUzlnber_sales_l2=l2.ZNLUzlnber_sales
(784 missing values generated)

->  gen DZNLUzlnber_sales_l3=l3.ZNLUzlnber_sales
(1176 missing values generated)

->  gen DZTFUzlnber_rsales_l0=ZTFUzlnber_rsales

->  gen DZTFUzlnber_rsales_l1=l1.ZTFUzlnber_rsales
(392 missing values generated)

->  gen DZTFUzlnber_rsales_l2=l2.ZTFUzlnber_rsales
(784 missing values generated)

->  gen DZTFUzlnber_rsales_l3=l3.ZTFUzlnber_rsales
(1176 missing values generated)

->  gen DZTLUzlnber_rsales_l0=ZTLUzlnber_rsales

->  gen DZTLUzlnber_rsales_l1=l1.ZTLUzlnber_rsales
(392 missing values generated)

->  gen DZTLUzlnber_rsales_l2=l2.ZTLUzlnber_rsales
(784 missing values generated)

->  gen DZTLUzlnber_rsales_l3=l3.ZTLUzlnber_rsales
(1176 missing values generated)

->  gen DZDLUzlnber_rsales_l0=ZDLUzlnber_rsales

->  gen DZDLUzlnber_rsales_l1=l1.ZDLUzlnber_rsales
(392 missing values generated)

->  gen DZDLUzlnber_rsales_l2=l2.ZDLUzlnber_rsales
(784 missing values generated)

->  gen DZDLUzlnber_rsales_l3=l3.ZDLUzlnber_rsales
(1176 missing values generated)

->  gen DZNLUzlnber_rsales_l0=ZNLUzlnber_rsales

->  gen DZNLUzlnber_rsales_l1=l1.ZNLUzlnber_rsales
(392 missing values generated)

->  gen DZNLUzlnber_rsales_l2=l2.ZNLUzlnber_rsales
(784 missing values generated)

->  gen DZNLUzlnber_rsales_l3=l3.ZNLUzlnber_rsales
(1176 missing values generated)

->  gen DZTFUzlnber_emp_l0=ZTFUzlnber_emp

->  gen DZTFUzlnber_emp_l1=l1.ZTFUzlnber_emp
(392 missing values generated)

->  gen DZTFUzlnber_emp_l2=l2.ZTFUzlnber_emp
(784 missing values generated)

->  gen DZTFUzlnber_emp_l3=l3.ZTFUzlnber_emp
(1176 missing values generated)

->  gen DZTLUzlnber_emp_l0=ZTLUzlnber_emp

->  gen DZTLUzlnber_emp_l1=l1.ZTLUzlnber_emp
(392 missing values generated)

->  gen DZTLUzlnber_emp_l2=l2.ZTLUzlnber_emp
(784 missing values generated)

->  gen DZTLUzlnber_emp_l3=l3.ZTLUzlnber_emp
(1176 missing values generated)

->  gen DZDLUzlnber_emp_l0=ZDLUzlnber_emp

->  gen DZDLUzlnber_emp_l1=l1.ZDLUzlnber_emp
(392 missing values generated)

->  gen DZDLUzlnber_emp_l2=l2.ZDLUzlnber_emp
(784 missing values generated)

->  gen DZDLUzlnber_emp_l3=l3.ZDLUzlnber_emp
(1176 missing values generated)

->  gen DZNLUzlnber_emp_l0=ZNLUzlnber_emp

->  gen DZNLUzlnber_emp_l1=l1.ZNLUzlnber_emp
(392 missing values generated)

->  gen DZNLUzlnber_emp_l2=l2.ZNLUzlnber_emp
(784 missing values generated)

->  gen DZNLUzlnber_emp_l3=l3.ZNLUzlnber_emp
(1176 missing values generated)

->  gen DZTFUlnber_rvadd_l0=ZTFUlnber_rvadd

->  gen DZTFUlnber_rvadd_l1=l1.ZTFUlnber_rvadd
(392 missing values generated)

->  gen DZTFUlnber_rvadd_l2=l2.ZTFUlnber_rvadd
(784 missing values generated)

->  gen DZTFUlnber_rvadd_l3=l3.ZTFUlnber_rvadd
(1176 missing values generated)

->  gen DZTLUlnber_rvadd_l0=ZTLUlnber_rvadd

->  gen DZTLUlnber_rvadd_l1=l1.ZTLUlnber_rvadd
(392 missing values generated)

->  gen DZTLUlnber_rvadd_l2=l2.ZTLUlnber_rvadd
(784 missing values generated)

->  gen DZTLUlnber_rvadd_l3=l3.ZTLUlnber_rvadd
(1176 missing values generated)

->  gen DZDLUlnber_rvadd_l0=ZDLUlnber_rvadd

->  gen DZDLUlnber_rvadd_l1=l1.ZDLUlnber_rvadd
(392 missing values generated)

->  gen DZDLUlnber_rvadd_l2=l2.ZDLUlnber_rvadd
(784 missing values generated)

->  gen DZDLUlnber_rvadd_l3=l3.ZDLUlnber_rvadd
(1176 missing values generated)

->  gen DZNLUlnber_rvadd_l0=ZNLUlnber_rvadd

->  gen DZNLUlnber_rvadd_l1=l1.ZNLUlnber_rvadd
(392 missing values generated)

->  gen DZNLUlnber_rvadd_l2=l2.ZNLUlnber_rvadd
(784 missing values generated)

->  gen DZNLUlnber_rvadd_l3=l3.ZNLUlnber_rvadd
(1176 missing values generated)

->  gen DZTFUlnber_emp_l0=ZTFUlnber_emp

->  gen DZTFUlnber_emp_l1=l1.ZTFUlnber_emp
(392 missing values generated)

->  gen DZTFUlnber_emp_l2=l2.ZTFUlnber_emp
(784 missing values generated)

->  gen DZTFUlnber_emp_l3=l3.ZTFUlnber_emp
(1176 missing values generated)

->  gen DZTLUlnber_emp_l0=ZTLUlnber_emp

->  gen DZTLUlnber_emp_l1=l1.ZTLUlnber_emp
(392 missing values generated)

->  gen DZTLUlnber_emp_l2=l2.ZTLUlnber_emp
(784 missing values generated)

->  gen DZTLUlnber_emp_l3=l3.ZTLUlnber_emp
(1176 missing values generated)

->  gen DZDLUlnber_emp_l0=ZDLUlnber_emp

->  gen DZDLUlnber_emp_l1=l1.ZDLUlnber_emp
(392 missing values generated)

->  gen DZDLUlnber_emp_l2=l2.ZDLUlnber_emp
(784 missing values generated)

->  gen DZDLUlnber_emp_l3=l3.ZDLUlnber_emp
(1176 missing values generated)

->  gen DZNLUlnber_emp_l0=ZNLUlnber_emp

->  gen DZNLUlnber_emp_l1=l1.ZNLUlnber_emp
(392 missing values generated)

->  gen DZNLUlnber_emp_l2=l2.ZNLUlnber_emp
(784 missing values generated)

->  gen DZNLUlnber_emp_l3=l3.ZNLUlnber_emp
(1176 missing values generated)

->  gen DZTFUlnber_rlprod_l0=ZTFUlnber_rlprod

->  gen DZTFUlnber_rlprod_l1=l1.ZTFUlnber_rlprod
(392 missing values generated)

->  gen DZTFUlnber_rlprod_l2=l2.ZTFUlnber_rlprod
(784 missing values generated)

->  gen DZTFUlnber_rlprod_l3=l3.ZTFUlnber_rlprod
(1176 missing values generated)

->  gen DZTLUlnber_rlprod_l0=ZTLUlnber_rlprod

->  gen DZTLUlnber_rlprod_l1=l1.ZTLUlnber_rlprod
(392 missing values generated)

->  gen DZTLUlnber_rlprod_l2=l2.ZTLUlnber_rlprod
(784 missing values generated)

->  gen DZTLUlnber_rlprod_l3=l3.ZTLUlnber_rlprod
(1176 missing values generated)

->  gen DZDLUlnber_rlprod_l0=ZDLUlnber_rlprod

->  gen DZDLUlnber_rlprod_l1=l1.ZDLUlnber_rlprod
(392 missing values generated)

->  gen DZDLUlnber_rlprod_l2=l2.ZDLUlnber_rlprod
(784 missing values generated)

->  gen DZDLUlnber_rlprod_l3=l3.ZDLUlnber_rlprod
(1176 missing values generated)

->  gen DZNLUlnber_rlprod_l0=ZNLUlnber_rlprod

->  gen DZNLUlnber_rlprod_l1=l1.ZNLUlnber_rlprod
(392 missing values generated)

->  gen DZNLUlnber_rlprod_l2=l2.ZNLUlnber_rlprod
(784 missing values generated)

->  gen DZNLUlnber_rlprod_l3=l3.ZNLUlnber_rlprod
(1176 missing values generated)

->  gen DZTFUl_import_usch_l0=ZTFUl_import_usch

->  gen DZTFUl_import_usch_l1=l1.ZTFUl_import_usch
(392 missing values generated)

->  gen DZTFUl_import_usch_l2=l2.ZTFUl_import_usch
(784 missing values generated)

->  gen DZTFUl_import_usch_l3=l3.ZTFUl_import_usch
(1176 missing values generated)

->  gen DZTLUl_import_usch_l0=ZTLUl_import_usch

->  gen DZTLUl_import_usch_l1=l1.ZTLUl_import_usch
(392 missing values generated)

->  gen DZTLUl_import_usch_l2=l2.ZTLUl_import_usch
(784 missing values generated)

->  gen DZTLUl_import_usch_l3=l3.ZTLUl_import_usch
(1176 missing values generated)

->  gen DZDLUl_import_usch_l0=ZDLUl_import_usch

->  gen DZDLUl_import_usch_l1=l1.ZDLUl_import_usch
(392 missing values generated)

->  gen DZDLUl_import_usch_l2=l2.ZDLUl_import_usch
(784 missing values generated)

->  gen DZDLUl_import_usch_l3=l3.ZDLUl_import_usch
(1176 missing values generated)

->  gen DZNLUl_import_usch_l0=ZNLUl_import_usch

->  gen DZNLUl_import_usch_l1=l1.ZNLUl_import_usch
(392 missing values generated)

->  gen DZNLUl_import_usch_l2=l2.ZNLUl_import_usch
(784 missing values generated)

->  gen DZNLUl_import_usch_l3=l3.ZNLUl_import_usch
(1176 missing values generated)

->  gen DZTFUl_import_otch_l0=ZTFUl_import_otch

->  gen DZTFUl_import_otch_l1=l1.ZTFUl_import_otch
(392 missing values generated)

->  gen DZTFUl_import_otch_l2=l2.ZTFUl_import_otch
(784 missing values generated)

->  gen DZTFUl_import_otch_l3=l3.ZTFUl_import_otch
(1176 missing values generated)

->  gen DZTLUl_import_otch_l0=ZTLUl_import_otch

->  gen DZTLUl_import_otch_l1=l1.ZTLUl_import_otch
(392 missing values generated)

->  gen DZTLUl_import_otch_l2=l2.ZTLUl_import_otch
(784 missing values generated)

->  gen DZTLUl_import_otch_l3=l3.ZTLUl_import_otch
(1176 missing values generated)

->  gen DZDLUl_import_otch_l0=ZDLUl_import_otch

->  gen DZDLUl_import_otch_l1=l1.ZDLUl_import_otch
(392 missing values generated)

->  gen DZDLUl_import_otch_l2=l2.ZDLUl_import_otch
(784 missing values generated)

->  gen DZDLUl_import_otch_l3=l3.ZDLUl_import_otch
(1176 missing values generated)

->  gen DZNLUl_import_otch_l0=ZNLUl_import_otch

->  gen DZNLUl_import_otch_l1=l1.ZNLUl_import_otch
(392 missing values generated)

->  gen DZNLUl_import_otch_l2=l2.ZNLUl_import_otch
(784 missing values generated)

->  gen DZNLUl_import_otch_l3=l3.ZNLUl_import_otch
(1176 missing values generated)

->  gen DZTFUesfed_l0=ZTFUesfed

->  gen DZTFUesfed_l1=l1.ZTFUesfed
(392 missing values generated)

->  gen DZTFUesfed_l2=l2.ZTFUesfed
(784 missing values generated)

->  gen DZTFUesfed_l3=l3.ZTFUesfed
(1176 missing values generated)

->  gen DZTLUesfed_l0=ZTLUesfed

->  gen DZTLUesfed_l1=l1.ZTLUesfed
(392 missing values generated)

->  gen DZTLUesfed_l2=l2.ZTLUesfed
(784 missing values generated)

->  gen DZTLUesfed_l3=l3.ZTLUesfed
(1176 missing values generated)

->  gen DZDLUesfed_l0=ZDLUesfed

->  gen DZDLUesfed_l1=l1.ZDLUesfed
(392 missing values generated)

->  gen DZDLUesfed_l2=l2.ZDLUesfed
(784 missing values generated)

->  gen DZDLUesfed_l3=l3.ZDLUesfed
(1176 missing values generated)

->  gen DZNLUesfed_l0=ZNLUesfed

->  gen DZNLUesfed_l1=l1.ZNLUesfed
(392 missing values generated)

->  gen DZNLUesfed_l2=l2.ZNLUesfed
(784 missing values generated)

->  gen DZNLUesfed_l3=l3.ZNLUesfed
(1176 missing values generated)

->  gen DZTFUltfp4_l0=ZTFUltfp4

->  gen DZTFUltfp4_l1=l1.ZTFUltfp4
(392 missing values generated)

->  gen DZTFUltfp4_l2=l2.ZTFUltfp4
(784 missing values generated)

->  gen DZTFUltfp4_l3=l3.ZTFUltfp4
(1176 missing values generated)

->  gen DZTLUltfp4_l0=ZTLUltfp4

->  gen DZTLUltfp4_l1=l1.ZTLUltfp4
(392 missing values generated)

->  gen DZTLUltfp4_l2=l2.ZTLUltfp4
(784 missing values generated)

->  gen DZTLUltfp4_l3=l3.ZTLUltfp4
(1176 missing values generated)

->  gen DZDLUltfp4_l0=ZDLUltfp4

->  gen DZDLUltfp4_l1=l1.ZDLUltfp4
(392 missing values generated)

->  gen DZDLUltfp4_l2=l2.ZDLUltfp4
(784 missing values generated)

->  gen DZDLUltfp4_l3=l3.ZDLUltfp4
(1176 missing values generated)

->  gen DZNLUltfp4_l0=ZNLUltfp4

->  gen DZNLUltfp4_l1=l1.ZNLUltfp4
(392 missing values generated)

->  gen DZNLUltfp4_l2=l2.ZNLUltfp4
(784 missing values generated)

->  gen DZNLUltfp4_l3=l3.ZNLUltfp4
(1176 missing values generated)

->  gen DZTFUltfp5_l0=ZTFUltfp5

->  gen DZTFUltfp5_l1=l1.ZTFUltfp5
(392 missing values generated)

->  gen DZTFUltfp5_l2=l2.ZTFUltfp5
(784 missing values generated)

->  gen DZTFUltfp5_l3=l3.ZTFUltfp5
(1176 missing values generated)

->  gen DZTLUltfp5_l0=ZTLUltfp5

->  gen DZTLUltfp5_l1=l1.ZTLUltfp5
(392 missing values generated)

->  gen DZTLUltfp5_l2=l2.ZTLUltfp5
(784 missing values generated)

->  gen DZTLUltfp5_l3=l3.ZTLUltfp5
(1176 missing values generated)

->  gen DZDLUltfp5_l0=ZDLUltfp5

->  gen DZDLUltfp5_l1=l1.ZDLUltfp5
(392 missing values generated)

->  gen DZDLUltfp5_l2=l2.ZDLUltfp5
(784 missing values generated)

->  gen DZDLUltfp5_l3=l3.ZDLUltfp5
(1176 missing values generated)

->  gen DZNLUltfp5_l0=ZNLUltfp5

->  gen DZNLUltfp5_l1=l1.ZNLUltfp5
(392 missing values generated)

->  gen DZNLUltfp5_l2=l2.ZNLUltfp5
(784 missing values generated)

->  gen DZNLUltfp5_l3=l3.ZNLUltfp5
(1176 missing values generated)

->  gen DZTFUlfmct_l0=ZTFUlfmct

->  gen DZTFUlfmct_l1=l1.ZTFUlfmct
(392 missing values generated)

->  gen DZTFUlfmct_l2=l2.ZTFUlfmct
(784 missing values generated)

->  gen DZTFUlfmct_l3=l3.ZTFUlfmct
(1176 missing values generated)

->  gen DZTLUlfmct_l0=ZTLUlfmct

->  gen DZTLUlfmct_l1=l1.ZTLUlfmct
(392 missing values generated)

->  gen DZTLUlfmct_l2=l2.ZTLUlfmct
(784 missing values generated)

->  gen DZTLUlfmct_l3=l3.ZTLUlfmct
(1176 missing values generated)

->  gen DZDLUlfmct_l0=ZDLUlfmct

->  gen DZDLUlfmct_l1=l1.ZDLUlfmct
(392 missing values generated)

->  gen DZDLUlfmct_l2=l2.ZDLUlfmct
(784 missing values generated)

->  gen DZDLUlfmct_l3=l3.ZDLUlfmct
(1176 missing values generated)

->  gen DZNLUlfmct_l0=ZNLUlfmct

->  gen DZNLUlfmct_l1=l1.ZNLUlfmct
(392 missing values generated)

->  gen DZNLUlfmct_l2=l2.ZNLUlfmct
(784 missing values generated)

->  gen DZNLUlfmct_l3=l3.ZNLUlfmct
(1176 missing values generated)

->  gen DZTFUlfuct_l0=ZTFUlfuct

->  gen DZTFUlfuct_l1=l1.ZTFUlfuct
(392 missing values generated)

->  gen DZTFUlfuct_l2=l2.ZTFUlfuct
(784 missing values generated)

->  gen DZTFUlfuct_l3=l3.ZTFUlfuct
(1176 missing values generated)

->  gen DZTLUlfuct_l0=ZTLUlfuct

->  gen DZTLUlfuct_l1=l1.ZTLUlfuct
(392 missing values generated)

->  gen DZTLUlfuct_l2=l2.ZTLUlfuct
(784 missing values generated)

->  gen DZTLUlfuct_l3=l3.ZTLUlfuct
(1176 missing values generated)

->  gen DZDLUlfuct_l0=ZDLUlfuct

->  gen DZDLUlfuct_l1=l1.ZDLUlfuct
(392 missing values generated)

->  gen DZDLUlfuct_l2=l2.ZDLUlfuct
(784 missing values generated)

->  gen DZDLUlfuct_l3=l3.ZDLUlfuct
(1176 missing values generated)

->  gen DZNLUlfuct_l0=ZNLUlfuct

->  gen DZNLUlfuct_l1=l1.ZNLUlfuct
(392 missing values generated)

->  gen DZNLUlfuct_l2=l2.ZNLUlfuct
(784 missing values generated)

->  gen DZNLUlfuct_l3=l3.ZNLUlfuct
(1176 missing values generated)

->  gen DGADzlnber_rvadd_l0=GADzlnber_rvadd

->  gen DGADzlnber_rvadd_l1=l1.GADzlnber_rvadd
(392 missing values generated)

->  gen DGADzlnber_rvadd_l2=l2.GADzlnber_rvadd
(784 missing values generated)

->  gen DGADzlnber_rvadd_l3=l3.GADzlnber_rvadd
(1176 missing values generated)

->  gen DGHDzlnber_rvadd_l0=GHDzlnber_rvadd

->  gen DGHDzlnber_rvadd_l1=l1.GHDzlnber_rvadd
(392 missing values generated)

->  gen DGHDzlnber_rvadd_l2=l2.GHDzlnber_rvadd
(784 missing values generated)

->  gen DGHDzlnber_rvadd_l3=l3.GHDzlnber_rvadd
(1176 missing values generated)

->  gen DGADzlnber_sales_l0=GADzlnber_sales

->  gen DGADzlnber_sales_l1=l1.GADzlnber_sales
(392 missing values generated)

->  gen DGADzlnber_sales_l2=l2.GADzlnber_sales
(784 missing values generated)

->  gen DGADzlnber_sales_l3=l3.GADzlnber_sales
(1176 missing values generated)

->  gen DGHDzlnber_sales_l0=GHDzlnber_sales

->  gen DGHDzlnber_sales_l1=l1.GHDzlnber_sales
(392 missing values generated)

->  gen DGHDzlnber_sales_l2=l2.GHDzlnber_sales
(784 missing values generated)

->  gen DGHDzlnber_sales_l3=l3.GHDzlnber_sales
(1176 missing values generated)

->  gen DGADzlnber_rsales_l0=GADzlnber_rsales

->  gen DGADzlnber_rsales_l1=l1.GADzlnber_rsales
(392 missing values generated)

->  gen DGADzlnber_rsales_l2=l2.GADzlnber_rsales
(784 missing values generated)

->  gen DGADzlnber_rsales_l3=l3.GADzlnber_rsales
(1176 missing values generated)

->  gen DGHDzlnber_rsales_l0=GHDzlnber_rsales

->  gen DGHDzlnber_rsales_l1=l1.GHDzlnber_rsales
(392 missing values generated)

->  gen DGHDzlnber_rsales_l2=l2.GHDzlnber_rsales
(784 missing values generated)

->  gen DGHDzlnber_rsales_l3=l3.GHDzlnber_rsales
(1176 missing values generated)

->  gen DGADzlnber_emp_l0=GADzlnber_emp

->  gen DGADzlnber_emp_l1=l1.GADzlnber_emp
(392 missing values generated)

->  gen DGADzlnber_emp_l2=l2.GADzlnber_emp
(784 missing values generated)

->  gen DGADzlnber_emp_l3=l3.GADzlnber_emp
(1176 missing values generated)

->  gen DGHDzlnber_emp_l0=GHDzlnber_emp

->  gen DGHDzlnber_emp_l1=l1.GHDzlnber_emp
(392 missing values generated)

->  gen DGHDzlnber_emp_l2=l2.GHDzlnber_emp
(784 missing values generated)

->  gen DGHDzlnber_emp_l3=l3.GHDzlnber_emp
(1176 missing values generated)

->  gen DGADlnber_rvadd_l0=GADlnber_rvadd

->  gen DGADlnber_rvadd_l1=l1.GADlnber_rvadd
(392 missing values generated)

->  gen DGADlnber_rvadd_l2=l2.GADlnber_rvadd
(784 missing values generated)

->  gen DGADlnber_rvadd_l3=l3.GADlnber_rvadd
(1176 missing values generated)

->  gen DGHDlnber_rvadd_l0=GHDlnber_rvadd

->  gen DGHDlnber_rvadd_l1=l1.GHDlnber_rvadd
(392 missing values generated)

->  gen DGHDlnber_rvadd_l2=l2.GHDlnber_rvadd
(784 missing values generated)

->  gen DGHDlnber_rvadd_l3=l3.GHDlnber_rvadd
(1176 missing values generated)

->  gen DGADlnber_emp_l0=GADlnber_emp

->  gen DGADlnber_emp_l1=l1.GADlnber_emp
(392 missing values generated)

->  gen DGADlnber_emp_l2=l2.GADlnber_emp
(784 missing values generated)

->  gen DGADlnber_emp_l3=l3.GADlnber_emp
(1176 missing values generated)

->  gen DGHDlnber_emp_l0=GHDlnber_emp

->  gen DGHDlnber_emp_l1=l1.GHDlnber_emp
(392 missing values generated)

->  gen DGHDlnber_emp_l2=l2.GHDlnber_emp
(784 missing values generated)

->  gen DGHDlnber_emp_l3=l3.GHDlnber_emp
(1176 missing values generated)

->  gen DGADlnber_rlprod_l0=GADlnber_rlprod

->  gen DGADlnber_rlprod_l1=l1.GADlnber_rlprod
(392 missing values generated)

->  gen DGADlnber_rlprod_l2=l2.GADlnber_rlprod
(784 missing values generated)

->  gen DGADlnber_rlprod_l3=l3.GADlnber_rlprod
(1176 missing values generated)

->  gen DGHDlnber_rlprod_l0=GHDlnber_rlprod

->  gen DGHDlnber_rlprod_l1=l1.GHDlnber_rlprod
(392 missing values generated)

->  gen DGHDlnber_rlprod_l2=l2.GHDlnber_rlprod
(784 missing values generated)

->  gen DGHDlnber_rlprod_l3=l3.GHDlnber_rlprod
(1176 missing values generated)

->  gen DGADl_import_usch_l0=GADl_import_usch

->  gen DGADl_import_usch_l1=l1.GADl_import_usch
(392 missing values generated)

->  gen DGADl_import_usch_l2=l2.GADl_import_usch
(784 missing values generated)

->  gen DGADl_import_usch_l3=l3.GADl_import_usch
(1176 missing values generated)

->  gen DGHDl_import_usch_l0=GHDl_import_usch

->  gen DGHDl_import_usch_l1=l1.GHDl_import_usch
(392 missing values generated)

->  gen DGHDl_import_usch_l2=l2.GHDl_import_usch
(784 missing values generated)

->  gen DGHDl_import_usch_l3=l3.GHDl_import_usch
(1176 missing values generated)

->  gen DGADl_import_otch_l0=GADl_import_otch

->  gen DGADl_import_otch_l1=l1.GADl_import_otch
(392 missing values generated)

->  gen DGADl_import_otch_l2=l2.GADl_import_otch
(784 missing values generated)

->  gen DGADl_import_otch_l3=l3.GADl_import_otch
(1176 missing values generated)

->  gen DGHDl_import_otch_l0=GHDl_import_otch

->  gen DGHDl_import_otch_l1=l1.GHDl_import_otch
(392 missing values generated)

->  gen DGHDl_import_otch_l2=l2.GHDl_import_otch
(784 missing values generated)

->  gen DGHDl_import_otch_l3=l3.GHDl_import_otch
(1176 missing values generated)

->  gen DGADesfed_l0=GADesfed

->  gen DGADesfed_l1=l1.GADesfed
(392 missing values generated)

->  gen DGADesfed_l2=l2.GADesfed
(784 missing values generated)

->  gen DGADesfed_l3=l3.GADesfed
(1176 missing values generated)

->  gen DGHDesfed_l0=GHDesfed

->  gen DGHDesfed_l1=l1.GHDesfed
(392 missing values generated)

->  gen DGHDesfed_l2=l2.GHDesfed
(784 missing values generated)

->  gen DGHDesfed_l3=l3.GHDesfed
(1176 missing values generated)

->  gen DGADltfp4_l0=GADltfp4

->  gen DGADltfp4_l1=l1.GADltfp4
(392 missing values generated)

->  gen DGADltfp4_l2=l2.GADltfp4
(784 missing values generated)

->  gen DGADltfp4_l3=l3.GADltfp4
(1176 missing values generated)

->  gen DGHDltfp4_l0=GHDltfp4

->  gen DGHDltfp4_l1=l1.GHDltfp4
(392 missing values generated)

->  gen DGHDltfp4_l2=l2.GHDltfp4
(784 missing values generated)

->  gen DGHDltfp4_l3=l3.GHDltfp4
(1176 missing values generated)

->  gen DGADltfp5_l0=GADltfp5

->  gen DGADltfp5_l1=l1.GADltfp5
(392 missing values generated)

->  gen DGADltfp5_l2=l2.GADltfp5
(784 missing values generated)

->  gen DGADltfp5_l3=l3.GADltfp5
(1176 missing values generated)

->  gen DGHDltfp5_l0=GHDltfp5

->  gen DGHDltfp5_l1=l1.GHDltfp5
(392 missing values generated)

->  gen DGHDltfp5_l2=l2.GHDltfp5
(784 missing values generated)

->  gen DGHDltfp5_l3=l3.GHDltfp5
(1176 missing values generated)

->  gen DGADlfmct_l0=GADlfmct

->  gen DGADlfmct_l1=l1.GADlfmct
(392 missing values generated)

->  gen DGADlfmct_l2=l2.GADlfmct
(784 missing values generated)

->  gen DGADlfmct_l3=l3.GADlfmct
(1176 missing values generated)

->  gen DGHDlfmct_l0=GHDlfmct

->  gen DGHDlfmct_l1=l1.GHDlfmct
(392 missing values generated)

->  gen DGHDlfmct_l2=l2.GHDlfmct
(784 missing values generated)

->  gen DGHDlfmct_l3=l3.GHDlfmct
(1176 missing values generated)

->  gen DGADlfuct_l0=GADlfuct

->  gen DGADlfuct_l1=l1.GADlfuct
(392 missing values generated)

->  gen DGADlfuct_l2=l2.GADlfuct
(784 missing values generated)

->  gen DGADlfuct_l3=l3.GADlfuct
(1176 missing values generated)

->  gen DGHDlfuct_l0=GHDlfuct

->  gen DGHDlfuct_l1=l1.GHDlfuct
(392 missing values generated)

->  gen DGHDlfuct_l2=l2.GHDlfuct
(784 missing values generated)

->  gen DGHDlfuct_l3=l3.GHDlfuct
(1176 missing values generated)

->  gen DGAUzlnber_rvadd_l0=GAUzlnber_rvadd

->  gen DGAUzlnber_rvadd_l1=l1.GAUzlnber_rvadd
(392 missing values generated)

->  gen DGAUzlnber_rvadd_l2=l2.GAUzlnber_rvadd
(784 missing values generated)

->  gen DGAUzlnber_rvadd_l3=l3.GAUzlnber_rvadd
(1176 missing values generated)

->  gen DGHUzlnber_rvadd_l0=GHUzlnber_rvadd

->  gen DGHUzlnber_rvadd_l1=l1.GHUzlnber_rvadd
(392 missing values generated)

->  gen DGHUzlnber_rvadd_l2=l2.GHUzlnber_rvadd
(784 missing values generated)

->  gen DGHUzlnber_rvadd_l3=l3.GHUzlnber_rvadd
(1176 missing values generated)

->  gen DGAUzlnber_sales_l0=GAUzlnber_sales

->  gen DGAUzlnber_sales_l1=l1.GAUzlnber_sales
(392 missing values generated)

->  gen DGAUzlnber_sales_l2=l2.GAUzlnber_sales
(784 missing values generated)

->  gen DGAUzlnber_sales_l3=l3.GAUzlnber_sales
(1176 missing values generated)

->  gen DGHUzlnber_sales_l0=GHUzlnber_sales

->  gen DGHUzlnber_sales_l1=l1.GHUzlnber_sales
(392 missing values generated)

->  gen DGHUzlnber_sales_l2=l2.GHUzlnber_sales
(784 missing values generated)

->  gen DGHUzlnber_sales_l3=l3.GHUzlnber_sales
(1176 missing values generated)

->  gen DGAUzlnber_rsales_l0=GAUzlnber_rsales

->  gen DGAUzlnber_rsales_l1=l1.GAUzlnber_rsales
(392 missing values generated)

->  gen DGAUzlnber_rsales_l2=l2.GAUzlnber_rsales
(784 missing values generated)

->  gen DGAUzlnber_rsales_l3=l3.GAUzlnber_rsales
(1176 missing values generated)

->  gen DGHUzlnber_rsales_l0=GHUzlnber_rsales

->  gen DGHUzlnber_rsales_l1=l1.GHUzlnber_rsales
(392 missing values generated)

->  gen DGHUzlnber_rsales_l2=l2.GHUzlnber_rsales
(784 missing values generated)

->  gen DGHUzlnber_rsales_l3=l3.GHUzlnber_rsales
(1176 missing values generated)

->  gen DGAUzlnber_emp_l0=GAUzlnber_emp

->  gen DGAUzlnber_emp_l1=l1.GAUzlnber_emp
(392 missing values generated)

->  gen DGAUzlnber_emp_l2=l2.GAUzlnber_emp
(784 missing values generated)

->  gen DGAUzlnber_emp_l3=l3.GAUzlnber_emp
(1176 missing values generated)

->  gen DGHUzlnber_emp_l0=GHUzlnber_emp

->  gen DGHUzlnber_emp_l1=l1.GHUzlnber_emp
(392 missing values generated)

->  gen DGHUzlnber_emp_l2=l2.GHUzlnber_emp
(784 missing values generated)

->  gen DGHUzlnber_emp_l3=l3.GHUzlnber_emp
(1176 missing values generated)

->  gen DGAUlnber_rvadd_l0=GAUlnber_rvadd

->  gen DGAUlnber_rvadd_l1=l1.GAUlnber_rvadd
(392 missing values generated)

->  gen DGAUlnber_rvadd_l2=l2.GAUlnber_rvadd
(784 missing values generated)

->  gen DGAUlnber_rvadd_l3=l3.GAUlnber_rvadd
(1176 missing values generated)

->  gen DGHUlnber_rvadd_l0=GHUlnber_rvadd

->  gen DGHUlnber_rvadd_l1=l1.GHUlnber_rvadd
(392 missing values generated)

->  gen DGHUlnber_rvadd_l2=l2.GHUlnber_rvadd
(784 missing values generated)

->  gen DGHUlnber_rvadd_l3=l3.GHUlnber_rvadd
(1176 missing values generated)

->  gen DGAUlnber_emp_l0=GAUlnber_emp

->  gen DGAUlnber_emp_l1=l1.GAUlnber_emp
(392 missing values generated)

->  gen DGAUlnber_emp_l2=l2.GAUlnber_emp
(784 missing values generated)

->  gen DGAUlnber_emp_l3=l3.GAUlnber_emp
(1176 missing values generated)

->  gen DGHUlnber_emp_l0=GHUlnber_emp

->  gen DGHUlnber_emp_l1=l1.GHUlnber_emp
(392 missing values generated)

->  gen DGHUlnber_emp_l2=l2.GHUlnber_emp
(784 missing values generated)

->  gen DGHUlnber_emp_l3=l3.GHUlnber_emp
(1176 missing values generated)

->  gen DGAUlnber_rlprod_l0=GAUlnber_rlprod

->  gen DGAUlnber_rlprod_l1=l1.GAUlnber_rlprod
(392 missing values generated)

->  gen DGAUlnber_rlprod_l2=l2.GAUlnber_rlprod
(784 missing values generated)

->  gen DGAUlnber_rlprod_l3=l3.GAUlnber_rlprod
(1176 missing values generated)

->  gen DGHUlnber_rlprod_l0=GHUlnber_rlprod

->  gen DGHUlnber_rlprod_l1=l1.GHUlnber_rlprod
(392 missing values generated)

->  gen DGHUlnber_rlprod_l2=l2.GHUlnber_rlprod
(784 missing values generated)

->  gen DGHUlnber_rlprod_l3=l3.GHUlnber_rlprod
(1176 missing values generated)

->  gen DGAUl_import_usch_l0=GAUl_import_usch

->  gen DGAUl_import_usch_l1=l1.GAUl_import_usch
(392 missing values generated)

->  gen DGAUl_import_usch_l2=l2.GAUl_import_usch
(784 missing values generated)

->  gen DGAUl_import_usch_l3=l3.GAUl_import_usch
(1176 missing values generated)

->  gen DGHUl_import_usch_l0=GHUl_import_usch

->  gen DGHUl_import_usch_l1=l1.GHUl_import_usch
(392 missing values generated)

->  gen DGHUl_import_usch_l2=l2.GHUl_import_usch
(784 missing values generated)

->  gen DGHUl_import_usch_l3=l3.GHUl_import_usch
(1176 missing values generated)

->  gen DGAUl_import_otch_l0=GAUl_import_otch

->  gen DGAUl_import_otch_l1=l1.GAUl_import_otch
(392 missing values generated)

->  gen DGAUl_import_otch_l2=l2.GAUl_import_otch
(784 missing values generated)

->  gen DGAUl_import_otch_l3=l3.GAUl_import_otch
(1176 missing values generated)

->  gen DGHUl_import_otch_l0=GHUl_import_otch

->  gen DGHUl_import_otch_l1=l1.GHUl_import_otch
(392 missing values generated)

->  gen DGHUl_import_otch_l2=l2.GHUl_import_otch
(784 missing values generated)

->  gen DGHUl_import_otch_l3=l3.GHUl_import_otch
(1176 missing values generated)

->  gen DGAUesfed_l0=GAUesfed

->  gen DGAUesfed_l1=l1.GAUesfed
(392 missing values generated)

->  gen DGAUesfed_l2=l2.GAUesfed
(784 missing values generated)

->  gen DGAUesfed_l3=l3.GAUesfed
(1176 missing values generated)

->  gen DGHUesfed_l0=GHUesfed

->  gen DGHUesfed_l1=l1.GHUesfed
(392 missing values generated)

->  gen DGHUesfed_l2=l2.GHUesfed
(784 missing values generated)

->  gen DGHUesfed_l3=l3.GHUesfed
(1176 missing values generated)

->  gen DGAUltfp4_l0=GAUltfp4

->  gen DGAUltfp4_l1=l1.GAUltfp4
(392 missing values generated)

->  gen DGAUltfp4_l2=l2.GAUltfp4
(784 missing values generated)

->  gen DGAUltfp4_l3=l3.GAUltfp4
(1176 missing values generated)

->  gen DGHUltfp4_l0=GHUltfp4

->  gen DGHUltfp4_l1=l1.GHUltfp4
(392 missing values generated)

->  gen DGHUltfp4_l2=l2.GHUltfp4
(784 missing values generated)

->  gen DGHUltfp4_l3=l3.GHUltfp4
(1176 missing values generated)

->  gen DGAUltfp5_l0=GAUltfp5

->  gen DGAUltfp5_l1=l1.GAUltfp5
(392 missing values generated)

->  gen DGAUltfp5_l2=l2.GAUltfp5
(784 missing values generated)

->  gen DGAUltfp5_l3=l3.GAUltfp5
(1176 missing values generated)

->  gen DGHUltfp5_l0=GHUltfp5

->  gen DGHUltfp5_l1=l1.GHUltfp5
(392 missing values generated)

->  gen DGHUltfp5_l2=l2.GHUltfp5
(784 missing values generated)

->  gen DGHUltfp5_l3=l3.GHUltfp5
(1176 missing values generated)

->  gen DGAUlfmct_l0=GAUlfmct

->  gen DGAUlfmct_l1=l1.GAUlfmct
(392 missing values generated)

->  gen DGAUlfmct_l2=l2.GAUlfmct
(784 missing values generated)

->  gen DGAUlfmct_l3=l3.GAUlfmct
(1176 missing values generated)

->  gen DGHUlfmct_l0=GHUlfmct

->  gen DGHUlfmct_l1=l1.GHUlfmct
(392 missing values generated)

->  gen DGHUlfmct_l2=l2.GHUlfmct
(784 missing values generated)

->  gen DGHUlfmct_l3=l3.GHUlfmct
(1176 missing values generated)

->  gen DGAUlfuct_l0=GAUlfuct

->  gen DGAUlfuct_l1=l1.GAUlfuct
(392 missing values generated)

->  gen DGAUlfuct_l2=l2.GAUlfuct
(784 missing values generated)

->  gen DGAUlfuct_l3=l3.GAUlfuct
(1176 missing values generated)

->  gen DGHUlfuct_l0=GHUlfuct

->  gen DGHUlfuct_l1=l1.GHUlfuct
(392 missing values generated)

->  gen DGHUlfuct_l2=l2.GHUlfuct
(784 missing values generated)

->  gen DGHUlfuct_l3=l3.GHUlfuct
(1176 missing values generated)
(7840 missing values generated)
(7840 missing values generated)
(note: you are using old merge syntax; see [D] merge for new syntax)
variable sic87dd does not uniquely identify observations in the master data

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |      8,232      100.00      100.00
------------+-----------------------------------
      Total |      8,232      100.00
i.year            _Iyear_1991-2011    (naturally coded; _Iyear_1991 omitted)
  sic3 was float now int
  sic2 was float now byte
  clstr was float now int
  wt1 was float now byte
  temp0 was float now int
  traded was float now byte
  (123,480 bytes saved)
file ./temp/nw-macro2b1.dta saved

->  erase ./temp/shock-baselines-temp.dta

->  erase ./temp/shock-stimulus-temp.dta

. ************************************;
. ************************************;
. *** ANALYSIS                     ***;
. ************************************;
. ************************************;
. **************************************;
. **************************************;
. *** OLS Single-Shock Estimations   ***;
. **************************************;
. **************************************;
. *** Core table OLS;
. local SH esfed;

. use if DO`SH'_l1!=. using ./temp/nw-macro2b1, clear;

.  for any nber_rvadd nber_emp nber_rsales:
> \ gen Tlag1=DlX_l1
> \ qui areg DlX_l0 Tlag1 DZTLU`SH'_l1 DZTLD`SH'_l1 DO`SH'_l1 DZR4LD`SH'_l1 [aw
> =wt1], a(year) cl(clstr)
> \ margins, dydx(Tlag1 DZTLU`SH'_l1 DZTLD`SH'_l1 DO`SH'_l1 )
> \ qui areg DlX_l0 Tlag1 DZNLU`SH'_l1 DZNLD`SH'_l1 DZDLU`SH'_l1 DZR4LD`SH'_l1 
> [aw=wt1], a(year) cl(clstr)
> \ margins, dydx(Tlag1 DZNLU`SH'_l1 DZNLD`SH'_l1 DZDLU`SH'_l1)
> \ test DZNLD`SH'_l1=DZDLU`SH'_l1
> \ drop Tlag*;

-> 

->  gen Tlag1=Dlnber_rvadd_l1
(496 missing values generated)

->  qui areg Dlnber_rvadd_l0 Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1 DZR4L
> Desfed_l1 [aw=wt1], a(year) cl(clstr)

->  margins, dydx(Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1 )

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Tlag1 |   .0188982   .0247929     0.76   0.446    -.0298459    .0676423
DZTLUesfed~1 |   .0165819   .0213828     0.78   0.439    -.0254577    .0586215
DZTLDesfed~1 |   .0223207   .0116774     1.91   0.057    -.0006377     .045279
  DOesfed_l1 |    .003786   .0032939     1.15   0.251      -.00269     .010262
------------------------------------------------------------------------------

->  qui areg Dlnber_rvadd_l0 Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1 DZ
> R4LDesfed_l1 [aw=wt1], a(year) cl(clstr)

->  margins, dydx(Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Tlag1 |   .0187714   .0247845     0.76   0.449    -.0299562     .067499
DZNLUesfed~1 |   .0272163    .022598     1.20   0.229    -.0172125    .0716451
DZNLDesfed~1 |    .024277   .0121038     2.01   0.046     .0004804    .0480736
DZDLUesfed~1 |   .0036835   .0032687     1.13   0.260     -.002743      .01011
------------------------------------------------------------------------------

->  test DZNLDesfed_l1=DZDLUesfed_l1

 ( 1)  DZNLDesfed_l1 - DZDLUesfed_l1 = 0

       F(  1,   391) =    2.31
            Prob > F =    0.1295

->  drop Tlag*

-> 

->  gen Tlag1=Dlnber_emp_l1
(496 missing values generated)

->  qui areg Dlnber_emp_l0 Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1 DZR4LDe
> sfed_l1 [aw=wt1], a(year) cl(clstr)

->  margins, dydx(Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1 )

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Tlag1 |   .1582124   .0206084     7.68   0.000     .1176953    .1987295
DZTLUesfed~1 |   .0089859   .0144245     0.62   0.534    -.0193734    .0373452
DZTLDesfed~1 |   .0057416   .0069186     0.83   0.407    -.0078606    .0193438
  DOesfed_l1 |   .0034044   .0029726     1.15   0.253    -.0024399    .0092487
------------------------------------------------------------------------------

->  qui areg Dlnber_emp_l0 Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1 DZR4
> LDesfed_l1 [aw=wt1], a(year) cl(clstr)

->  margins, dydx(Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Tlag1 |   .1581416   .0206205     7.67   0.000     .1176007    .1986825
DZNLUesfed~1 |   .0144567   .0174693     0.83   0.408    -.0198889    .0488023
DZNLDesfed~1 |   .0065323   .0074792     0.87   0.383    -.0081722    .0212367
DZDLUesfed~1 |   .0032669    .002923     1.12   0.264    -.0024798    .0090136
------------------------------------------------------------------------------

->  test DZNLDesfed_l1=DZDLUesfed_l1

 ( 1)  DZNLDesfed_l1 - DZDLUesfed_l1 = 0

       F(  1,   391) =    0.13
            Prob > F =    0.7166

->  drop Tlag*

-> 

->  gen Tlag1=Dlnber_rsales_l1
(496 missing values generated)

->  qui areg Dlnber_rsales_l0 Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1 DZR4
> LDesfed_l1 [aw=wt1], a(year) cl(clstr)

->  margins, dydx(Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1 )

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : Tlag1 DZTLUesfed_l1 DZTLDesfed_l1 DOesfed_l1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Tlag1 |   .1776777   .0256261     6.93   0.000     .1272954    .2280599
DZTLUesfed~1 |   .0002181   .0175691     0.01   0.990    -.0343236    .0347597
DZTLDesfed~1 |    .017426   .0097803     1.78   0.076    -.0018026    .0366546
  DOesfed_l1 |   .0051488   .0028647     1.80   0.073    -.0004833     .010781
------------------------------------------------------------------------------

->  qui areg Dlnber_rsales_l0 Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1 D
> ZR4LDesfed_l1 [aw=wt1], a(year) cl(clstr)

->  margins, dydx(Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : Tlag1 DZNLUesfed_l1 DZNLDesfed_l1 DZDLUesfed_l1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Tlag1 |   .1775999    .025633     6.93   0.000     .1272042    .2279956
DZNLUesfed~1 |   .0051241   .0192649     0.27   0.790    -.0327516    .0429998
DZNLDesfed~1 |    .018211   .0103107     1.77   0.078    -.0020605    .0384824
DZDLUesfed~1 |   .0050551   .0028477     1.78   0.077    -.0005436    .0106538
------------------------------------------------------------------------------

->  test DZNLDesfed_l1=DZDLUesfed_l1

 ( 1)  DZNLDesfed_l1 - DZDLUesfed_l1 = 0

       F(  1,   391) =    1.28
            Prob > F =    0.2590

->  drop Tlag*

. *** Core table IV;
. local SH l_import_usch;

. local IV l_import_otch;

. use if DO`SH'_l1!=. using ./temp/nw-macro2b1, clear;

.  for any nber_rvadd nber_emp nber_rsales:
> \ gen Tlag1=DlX_l1
> \ qui ivregress 2sls DlX_l0 Tlag1 (DZTLU`SH'_l1 DZTLD`SH'_l1 DO`SH'_l1 DZR4LD
> `SH'_l1=DZTLU`IV'_l1 DZTLD`IV'_l1 DO`IV'_l1 DZR4LD`IV'_l1) _I* [aw=wt1], cl(c
> lstr)
> \ margins, dydx(Tlag1 DZTLU`SH'_l1 DZTLD`SH'_l1 DO`SH'_l1)
> \ qui ivregress 2sls DlX_l0 Tlag1 (DZNLU`SH'_l1 DZNLD`SH'_l1 DZDLU`SH'_l1 DZR
> 4LD`SH'_l1=DZNLU`IV'_l1 DZNLD`IV'_l1 DZDLU`IV'_l1 DZR4LD`IV'_l1) _I* [aw=wt1]
> , vce(cl clstr)
> \ margins, dydx(Tlag1 DZNLU`SH'_l1 DZNLD`SH'_l1 DZDLU`SH'_l1)
> \ test DZNLD`SH'_l1=DZDLU`SH'_l1
> \ drop Tlag*;

-> 

->  gen Tlag1=Dlnber_rvadd_l1
(496 missing values generated)

->  qui ivregress 2sls Dlnber_rvadd_l0 Tlag1 (DZTLUl_import_usch_l1 DZTLDl_impo
> rt_usch_l1 DOl_import_usch_l1 DZR4LDl_import_usch_l1=DZTLUl_import_otch_l1 DZ
> TLDl_import_otch_l1 DOl_import_otch_l1 DZR4LDl_import_otch_l1) _I* [aw=wt1], 
> cl(clstr)

->  margins, dydx(Tlag1 DZTLUl_import_usch_l1 DZTLDl_import_usch_l1 DOl_import_
> usch_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : DZTLUl_import_usch_l1 DZTLDl_import_usch_l1 DOl_import_usch_l1
               Tlag1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
DZTLU~sch_l1 |  -.1661163   .0914881    -1.82   0.069    -.3454296     .013197
DZTLD~sch_l1 |   .1088034    .041271     2.64   0.008     .0279138     .189693
DOl_i~sch_l1 |   .0316344   .0089114     3.55   0.000     .0141684    .0491004
       Tlag1 |   .0177866   .0253313     0.70   0.483     -.031862    .0674351
------------------------------------------------------------------------------

->  qui ivregress 2sls Dlnber_rvadd_l0 Tlag1 (DZNLUl_import_usch_l1 DZNLDl_impo
> rt_usch_l1 DZDLUl_import_usch_l1 DZR4LDl_import_usch_l1=DZNLUl_import_otch_l1
>  DZNLDl_import_otch_l1 DZDLUl_import_otch_l1 DZR4LDl_import_otch_l1) _I* [aw=
> wt1], vce(cl clstr)

->  margins, dydx(Tlag1 DZNLUl_import_usch_l1 DZNLDl_import_usch_l1 DZDLUl_impo
> rt_usch_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : DZNLUl_import_usch_l1 DZNLDl_import_usch_l1
               DZDLUl_import_usch_l1 Tlag1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
DZNLU~sch_l1 |  -.1415013   .0793914    -1.78   0.075    -.2971055    .0141029
DZNLD~sch_l1 |   .1096743   .0416489     2.63   0.008     .0280439    .1913046
DZDLU~sch_l1 |   .0296469   .0087344     3.39   0.001     .0125279     .046766
       Tlag1 |    .018863   .0256649     0.73   0.462    -.0314394    .0691654
------------------------------------------------------------------------------

->  test DZNLDl_import_usch_l1=DZDLUl_import_usch_l1

 ( 1)  DZNLDl_import_usch_l1 - DZDLUl_import_usch_l1 = 0

           chi2(  1) =    3.45
         Prob > chi2 =    0.0632

->  drop Tlag*

-> 

->  gen Tlag1=Dlnber_emp_l1
(496 missing values generated)

->  qui ivregress 2sls Dlnber_emp_l0 Tlag1 (DZTLUl_import_usch_l1 DZTLDl_import
> _usch_l1 DOl_import_usch_l1 DZR4LDl_import_usch_l1=DZTLUl_import_otch_l1 DZTL
> Dl_import_otch_l1 DOl_import_otch_l1 DZR4LDl_import_otch_l1) _I* [aw=wt1], cl
> (clstr)

->  margins, dydx(Tlag1 DZTLUl_import_usch_l1 DZTLDl_import_usch_l1 DOl_import_
> usch_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : DZTLUl_import_usch_l1 DZTLDl_import_usch_l1 DOl_import_usch_l1
               Tlag1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
DZTLU~sch_l1 |  -.0835359   .0464653    -1.80   0.072    -.1746061    .0075344
DZTLD~sch_l1 |   .0840153   .0268812     3.13   0.002      .031329    .1367015
DOl_i~sch_l1 |   .0208367   .0047866     4.35   0.000     .0114552    .0302182
       Tlag1 |   .1457545   .0197283     7.39   0.000     .1070879    .1844212
------------------------------------------------------------------------------

->  qui ivregress 2sls Dlnber_emp_l0 Tlag1 (DZNLUl_import_usch_l1 DZNLDl_import
> _usch_l1 DZDLUl_import_usch_l1 DZR4LDl_import_usch_l1=DZNLUl_import_otch_l1 D
> ZNLDl_import_otch_l1 DZDLUl_import_otch_l1 DZR4LDl_import_otch_l1) _I* [aw=wt
> 1], vce(cl clstr)

->  margins, dydx(Tlag1 DZNLUl_import_usch_l1 DZNLDl_import_usch_l1 DZDLUl_impo
> rt_usch_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : DZNLUl_import_usch_l1 DZNLDl_import_usch_l1
               DZDLUl_import_usch_l1 Tlag1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
DZNLU~sch_l1 |   -.053155   .0480444    -1.11   0.269    -.1473203    .0410102
DZNLD~sch_l1 |   .0854844   .0274045     3.12   0.002     .0317725    .1391963
DZDLU~sch_l1 |   .0200146   .0045609     4.39   0.000     .0110755    .0289537
       Tlag1 |   .1458831   .0198498     7.35   0.000     .1069783     .184788
------------------------------------------------------------------------------

->  test DZNLDl_import_usch_l1=DZDLUl_import_usch_l1

 ( 1)  DZNLDl_import_usch_l1 - DZDLUl_import_usch_l1 = 0

           chi2(  1) =    5.35
         Prob > chi2 =    0.0207

->  drop Tlag*

-> 

->  gen Tlag1=Dlnber_rsales_l1
(496 missing values generated)

->  qui ivregress 2sls Dlnber_rsales_l0 Tlag1 (DZTLUl_import_usch_l1 DZTLDl_imp
> ort_usch_l1 DOl_import_usch_l1 DZR4LDl_import_usch_l1=DZTLUl_import_otch_l1 D
> ZTLDl_import_otch_l1 DOl_import_otch_l1 DZR4LDl_import_otch_l1) _I* [aw=wt1],
>  cl(clstr)

->  margins, dydx(Tlag1 DZTLUl_import_usch_l1 DZTLDl_import_usch_l1 DOl_import_
> usch_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : DZTLUl_import_usch_l1 DZTLDl_import_usch_l1 DOl_import_usch_l1
               Tlag1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
DZTLU~sch_l1 |  -.1758069   .0668355    -2.63   0.009    -.3068022   -.0448116
DZTLD~sch_l1 |   .0978428   .0365236     2.68   0.007     .0262578    .1694278
DOl_i~sch_l1 |   .0179847    .005808     3.10   0.002     .0066013    .0293681
       Tlag1 |   .1731725   .0266063     6.51   0.000     .1210251      .22532
------------------------------------------------------------------------------

->  qui ivregress 2sls Dlnber_rsales_l0 Tlag1 (DZNLUl_import_usch_l1 DZNLDl_imp
> ort_usch_l1 DZDLUl_import_usch_l1 DZR4LDl_import_usch_l1=DZNLUl_import_otch_l
> 1 DZNLDl_import_otch_l1 DZDLUl_import_otch_l1 DZR4LDl_import_otch_l1) _I* [aw
> =wt1], vce(cl clstr)

->  margins, dydx(Tlag1 DZNLUl_import_usch_l1 DZNLDl_import_usch_l1 DZDLUl_impo
> rt_usch_l1)

Average marginal effects                          Number of obs   =       6560
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : DZNLUl_import_usch_l1 DZNLDl_import_usch_l1
               DZDLUl_import_usch_l1 Tlag1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
DZNLU~sch_l1 |  -.1422561   .0626795    -2.27   0.023    -.2651056   -.0194066
DZNLD~sch_l1 |   .0990892   .0370214     2.68   0.007     .0265287    .1716497
DZDLU~sch_l1 |   .0157239   .0055426     2.84   0.005     .0048606    .0265873
       Tlag1 |   .1748952   .0269082     6.50   0.000     .1221561    .2276342
------------------------------------------------------------------------------

->  test DZNLDl_import_usch_l1=DZDLUl_import_usch_l1

 ( 1)  DZNLDl_import_usch_l1 - DZDLUl_import_usch_l1 = 0

           chi2(  1) =    4.87
         Prob > chi2 =    0.0274

->  drop Tlag*

. *** End of program;
. log close;
      name:  <unnamed>
       log:  /nas-vol/projects/data_vol4/wkerr_ethnicity_project/networks/macro
> /replication/nw-macro-2b.log
  log type:  text
 closed on:   1 Sep 2015, 11:46:59
-------------------------------------------------------------------------------
